[{"cardNo":1,"cardLevel":1,"cardBody":"亅","cardMeaning":["Barb"],"meaningMnemonic":"This radical is shaped like abarb. Like the kind you'd see on barb wire. Imagine one of these getting stuck to your arm or your clothes. Think about how much it would hurt with that little hook on the end sticking into you. Say out loud, \"Oh dang, I got a barb stuck in me!\"","type":"radical"},{"cardNo":2,"cardLevel":1,"cardBody":"大","cardMeaning":["Big"],"meaningMnemonic":"This radical looks just like a stick figure—more specifically, a reallybigguy with his arms stretched out nice and big. When you see this radical, just think big, because this guy is really BIG!","type":"radical"},{"cardNo":3,"cardLevel":1,"cardBody":"工","cardMeaning":["Construction"],"meaningMnemonic":"You know those big steel girders that are used for the frame of big buildings? This is like the end of one of those, and have a very distinct shape, just like this radical. These girders are used in construction, which is why this radical meansconstruction. Funny thing is, you use these girders to put together buildings just like you're going to use this radical to put together kanji!","type":"radical"},{"cardNo":4,"cardLevel":1,"cardBody":"十","cardMeaning":["Cross"],"meaningMnemonic":"This radical looks like across. I mean, just look at it. Two bars going through each other = a cross!","type":"radical"},{"cardNo":5,"cardLevel":1,"cardBody":"丶","cardMeaning":["Drop"],"meaningMnemonic":"This little radical is adropof water or some other liquid. Notice how it's only one drop? Sometimes radicals or kanji will have more than one drop, so it's important that you know how to tell them apart.","type":"radical"},{"cardNo":6,"cardLevel":1,"cardBody":"入","cardMeaning":["Enter"],"meaningMnemonic":"Watch out! This isn't the person radical, it's something else. What's the difference? The right side is longer than the left side. And on computers, it usually has that extra part sticking out of the top. It kind of looks like a flap opening to a teepee. And what do you do with an opening? You enter it! That's why this radical isenter.","type":"radical"},{"cardNo":7,"cardLevel":1,"cardBody":"ハ","cardMeaning":["Fins"],"meaningMnemonic":"Picture a fish. Now picture the fish a little worse, like a child's drawing of the fish. Now erase the fish's body and... you're left with twofins! Do you see these two fins? Yeah, you see them.","type":"radical"},{"cardNo":8,"cardLevel":1,"cardBody":"一","cardMeaning":["Ground"],"meaningMnemonic":"This radical consists of a single, horizontal stroke. What's the biggest, single, horizontal stroke? That's theground. Look at the ground, look at this radical, now look at the ground again. Kind of the same, right?","type":"radical"},{"cardNo":9,"cardLevel":1,"cardMeaning":["Gun"],"meaningMnemonic":"Doesn't this look like a longgun? You have a shoulder rest and the barrel. Bam bam bam! Imagine looking down its long barrel at a target. Feel the rest on your shoulder. Now that's a nice gun!","type":"radical"},{"cardNo":10,"cardLevel":1,"cardMeaning":["Leaf"],"meaningMnemonic":"There's a leaf on top and a stem going down out of it, making it theleafradical. It looks kind of like a lilypad, sitting on top of the water with its stem going down to the bottom where the dirt is.","type":"radical"},{"cardNo":11,"cardLevel":1,"cardBody":"亠","cardMeaning":["Lid"],"meaningMnemonic":"This looks like something you'd put on a kettle or a pot, right? It even has a little handle to make sure you don't burn yourself. This is some kind oflid.","type":"radical"},{"cardNo":12,"cardLevel":1,"cardBody":"山","cardMeaning":["Mountain"],"meaningMnemonic":"This is amountain. You'll have to add the lines that make up the top of the mountain if you want it more \"mountain-like.\" Also something that might help: sometimes mountains have a couple of smaller peaks coming out the side of the main peak too. Connect the dots and create the mountain in your mind.","type":"radical"},{"cardNo":13,"cardLevel":1,"cardBody":"口","cardMeaning":["Mouth"],"meaningMnemonic":"A big, gaping, square hole represents someone opening their giantmouthto tell you something stupid.","type":"radical"},{"cardNo":14,"cardLevel":1,"cardBody":"九","cardMeaning":["Nine"],"meaningMnemonic":"If you look at this radical in just the right way, you'll notice that it kind of looks like the letters \"n\" and \"i\" (the \"i\" comes from the little flippy-up stroke on the right side). What do the letters \"n\" and \"i\" start spelling? Why, the wordnine.","type":"radical"},{"cardNo":15,"cardLevel":1,"cardBody":"人","cardMeaning":["Person"],"meaningMnemonic":"If you were to draw apersonwith just strokes like you see in kanji, you'd create a stick figure, maybe something like this:大. But this is just a person, not someone holding out their arms to show how big they are. So their arms are down, which makes them look like a torso with a pair of legs. Maybe they're walking too, which is why their legs are spread out like that. You can see the person now, can't you?","type":"radical"},{"cardNo":16,"cardLevel":1,"cardBody":"力","cardMeaning":["Power"],"meaningMnemonic":"Imagine a guy flexing his arm downward to show off his steroid-pumped arm. It's huge. It's so full ofpower. RARRRWWWRRR!!","type":"radical"},{"cardNo":17,"cardLevel":1,"cardBody":"勹","cardMeaning":["Prison"],"meaningMnemonic":"This looks like an enclosure of sorts - that's why it's aprison. It wraps itself around things and locks them in there. Prisons are pretty scary, even before you imagine one slowly floating down from the sky to trap you.","type":"radical"},{"cardNo":18,"cardLevel":1,"cardBody":"川","cardMeaning":["River"],"meaningMnemonic":"This radical already looks like ariver. See the banks of the river on the side and the flow of the river in the middle? There's even a slight turn in the river too. So when you see this radical, you should think \"river.\"","type":"radical"},{"cardNo":19,"cardLevel":1,"cardBody":"七","cardMeaning":["Seven"],"meaningMnemonic":"What does this radical look like? Hmm, nothing much. What about if you turn it upside down? Now does it look like a 7 with a line through it? Close enough to help you to remember that this radical isseven, right? Just remember, when you see this radical, flip it over and see what number it looks like. If you can do that, you can remember the meaning!","type":"radical"},{"cardNo":20,"cardLevel":1,"cardBody":"丿","cardMeaning":["Slide"],"meaningMnemonic":"Close your eyes and imagine you're a kid again. Now open them and... look! It's aslide! Imagine little you sliding down this slide over and over, having a great time. Imagination + emotion makes for good memorization!","type":"radical"},{"cardNo":21,"cardLevel":1,"cardMeaning":["Stick"],"meaningMnemonic":"This is astick, sticking out of the ground. It even looks like a stick.","type":"radical"},{"cardNo":22,"cardLevel":1,"cardBody":"日","cardMeaning":["Sun"],"meaningMnemonic":"Since there are no circles in Japanese characters, sometimes rectangles or squares have to make do. In this case, this big rectangle is thesun. The middle line going through the center horizontally is the equator. Or maybe it's a cloud, moving across the sun. Picture it, but don't actually look at the sun and burn your eyes!","type":"radical"},{"cardNo":23,"cardLevel":1,"cardBody":"ト","cardMeaning":["Toe"],"meaningMnemonic":"This radical looks just like the katakana characterト(to), which sounds like the wordtoe. So when you seeト, think toe.","type":"radical"},{"cardNo":24,"cardLevel":1,"cardBody":"木","cardMeaning":["Tree"],"meaningMnemonic":"Do you see thetreein here? It has branches, and then it has the foliage coming down diagonally from it, spreading out like a tree would. That's why this radical is a tree.","type":"radical"},{"cardNo":25,"cardLevel":1,"cardBody":"二","cardMeaning":["Two"],"meaningMnemonic":"One line plus another line equalstwolines. This radical represents the number two. Pretty simple, right? Can you guess what three looks like? I bet you can...","type":"radical"},{"cardNo":26,"cardLevel":1,"cardBody":"女","cardMeaning":["Woman"],"meaningMnemonic":"This radical looks like a wide person made up of two stacked Xs. Women generally have two XXs for chromosomes, and back in the day they were praised for their wide, child-bearing hips. We may not think of women this way anymore, but way back when Japanese was made, this made them think of awoman.","type":"radical"},{"type":"radical","cardNo":85,"cardLevel":2,"cardBody":"本","cardMeaning":["Book"],"meaningMnemonic":"There's a cut right at the base of this tree. Why would someone cut down a tree? To make abookout of it! Imagine living in the old days when you'd have to cut down a tree yourself to write or read a book."},{"type":"radical","cardNo":86,"cardLevel":2,"cardBody":"弓","cardMeaning":["Bow"],"meaningMnemonic":"This radical looks like a fancy compositebowpeople would use to shoot at targets and definitely not any normal living animals. See how the middle part is being pulled back? Imagine holding this bow and firing it at a target shaped like a giant alligator-crab monster."},{"type":"radical","cardNo":87,"cardLevel":2,"cardBody":"子","cardMeaning":["Child"],"meaningMnemonic":"This radical is made up of two barbs and one ground radical. If there are barbs on the ground, whom (especially) do you want to avoid that area? You want yourchildto avoid it, since children are so careless and often don't wear shoes. Imagine how bad you'd feel if you let a child walk around on top of these barbs! Pretty bad, I imagine."},{"type":"radical","cardNo":88,"cardLevel":2,"cardBody":"牛","cardMeaning":["Cow"],"meaningMnemonic":"There's a cross and a gun, with the gun going through the cross. You're using the cross to stabilize your gun, because you need to shoot acowfor dinner. You bring your cross because you need to bless the cow once you've killed it (and it's also a good stand for your gun). Poor cow."},{"type":"radical","cardNo":89,"cardLevel":2,"cardBody":"土","cardMeaning":["Dirt"],"meaningMnemonic":"There's a cross drawn on the ground, making thisdirt. You can draw anything in the dirt, it just happens to be a cross this time. Imagine drawing a cross in the dirt with your finger. Feel the dirt get stuck under your fingernail and never forget."},{"type":"radical","cardNo":90,"cardLevel":2,"cardBody":"犬","cardMeaning":["Dog"],"meaningMnemonic":"Remember the big guy that helped you remember the big radical? Now the big guy has something on his shoulder... what is that? You look and see that he has adogup there, perched as if it were a parrot or a cat or something. Dogs aren't supposed to be up on people's shoulders like that, but for him? It works!"},{"type":"radical","cardNo":91,"cardLevel":2,"cardBody":"夕","cardMeaning":["Evening"],"meaningMnemonic":"Do you see the prison and drop radicals making up this radical? This prison is holding onto a drop because it's theevening. Evening air does a better job of holding on to drops of liquid like this, which is why everything is covered in dew in the morning."},{"type":"radical","cardNo":92,"cardLevel":2,"cardBody":"目","cardMeaning":["Eye"],"meaningMnemonic":"See the iris in the middle of the eyeball? Remember that there are no round things in kanji, so square things take their place. That makes this a pretty realistic, squareeye. You just have to squint with your real eyes a bit."},{"type":"radical","cardNo":93,"cardLevel":2,"cardBody":"火","cardMeaning":["Fire"],"meaningMnemonic":"See the person radical here? It's got things coming off of it... what are those things—OH MY GOD IT'SFIRE!!! Help, help! Put the fire out!"},{"type":"radical","cardNo":94,"cardLevel":2,"cardBody":"五","cardMeaning":["Five"],"meaningMnemonic":"If you use your imagination, this radical actually looks like the number \"5.\" You have to remove the vertical line in the bottom left, but once you do that, you have an easy way to remember that this radical meansfive."},{"type":"radical","cardNo":95,"cardLevel":2,"cardBody":"尸","cardMeaning":["Flag"],"meaningMnemonic":"See theflagin this radical? There's a pole with a flag on the end of it, blowing in the wind. Basically, this radical looks just like a flag."},{"type":"radical","cardNo":96,"cardLevel":2,"cardBody":"彡","cardMeaning":["Hair"],"meaningMnemonic":"These three streaks flowing off to the side are three strands of hair. Pretty easy to see and remember, right?"},{"type":"radical","cardNo":97,"cardLevel":2,"cardBody":"手","cardMeaning":["Hand"],"meaningMnemonic":"This one's a little tough to picture, but I believe in you. The barb in the middle is the wrist/arm. Then, there are four regular fingers coming off of it and then one big thumb (the slide radical at the top). So you have four fingers, a thumb, and a wrist. This is what makes up your crazy lookinghand."},{"type":"radical","cardNo":98,"cardLevel":2,"cardBody":"冂","cardMeaning":["Head"],"meaningMnemonic":"This is the kind ofheada child might draw—can you imagine it with eyes, nose, mouth, and ears too? Whoever's head this is, it's really square. Maybe it's the head of a famous cartoon spongeman. Hmm."},{"type":"radical","cardNo":99,"cardLevel":2,"cardBody":"天","cardMeaning":["Heaven"],"meaningMnemonic":"There is a two radical and a person radical. The first level of a person's life is on earth. The second level (this level, which is why there's a two radical here) is in heaven. So when you see a person at level 2, you know they're inheaven."},{"type":"radical","cardNo":100,"cardLevel":2,"cardBody":"王","cardMeaning":["King"],"meaningMnemonic":"This radical is not something anyone can have. Only akingcan wear this crown upon his head. This radical is the sign of kings. Imagine your favorite king wearing this on their head. It's a pretty distinctive shape—I think you can do it."},{"type":"radical","cardNo":101,"cardLevel":2,"cardBody":"儿","cardMeaning":["Legs"],"meaningMnemonic":"This radical already looks like a pair oflegs. There's even feet on these legs (unlike the fins radical, which you learned earlier). That's how you know these are legs and not fins (or something else)."},{"type":"radical","cardNo":102,"cardLevel":2,"cardBody":"中","cardMeaning":["Middle"],"meaningMnemonic":"There's a stick going right through themiddleof someone's mouth! Imagine that mouth being yours. Measure the placement of the stick. Perfectly aligned, right in the middle. That's amazing, though to be honest, you probably have bigger problems than measuring the location of this stick in your mouth."},{"type":"radical","cardNo":103,"cardLevel":2,"cardBody":"月","cardMeaning":["Moon"],"meaningMnemonic":"Themoonis actually made of the sun, but it has little legs coming off of it leaning towards the left. Why? Because the moon is always running away from the sun as fast as it can. It doesn't want to get caught on fire, so it has to run to stay ahead!"},{"type":"radical","cardNo":104,"cardLevel":2,"cardBody":"ナ","cardMeaning":["Narwhal"],"meaningMnemonic":"This radical looks like the katakana characterナ(na), which we're going to say stands fornarwhal. Plus, this radical kind of looks like a narwhal, right? The body and head on the bottom, and the single majestic narwhal horn coming out the top, shooting up out of the water and into the air. Oh, and don't confuse this radical with treasure. The sideways line for narwhal (ナ) is horizontal, the sideways line for treasure is at more of a downward angle (メ), like an \"X.\""},{"type":"radical","cardNo":105,"cardLevel":2,"cardBody":"ム","cardMeaning":["Private"],"meaningMnemonic":"This is a little triangle that's almost completely closed off. When you want to be alone, you hide in a place where you can be inprivate. That's why this is the private radical. You're closing yourself off to the rest of the world, with just a little peephole."},{"type":"radical","cardNo":106,"cardLevel":2,"cardBody":"田","cardMeaning":["Rice Paddy"],"meaningMnemonic":"Rice paddies are made up of fields with irrigation lines going between them. See the four rice paddies with water flowing between and around them? That's why this radical isrice paddy."},{"type":"radical","cardNo":107,"cardLevel":2,"cardBody":"小","cardMeaning":["Small"],"meaningMnemonic":"You have fins and you have a barb. A fish that you can stick an entire barb through like this would have to be reallysmall, since it's sticking through the whole fish body (which you can imagine by basing the body off the size of the fins compared to the already small barb.)"},{"type":"radical","cardNo":108,"cardLevel":2,"cardBody":"立","cardMeaning":["Stand"],"meaningMnemonic":"Two sticks are propping up a lid. By doing this, they're making itstandup."},{"type":"radical","cardNo":109,"cardLevel":2,"cardBody":"石","cardMeaning":["Stone"],"meaningMnemonic":"There's a leaf growing out of a square thing (which is normally a mouth, but not this time). The leaf is growing out of astone. I mean, obviously, because leaves don't grow out of mouths. I hope. Anyway, Picture a stone in the middle of nature with a leaf growing out of it or just behind it and you'll never forget this radical!"},{"type":"radical","cardNo":110,"cardLevel":2,"cardBody":"又","cardMeaning":["Stool"],"meaningMnemonic":"This looks just like a fold-outstool, amiright?"},{"type":"radical","cardNo":111,"cardLevel":2,"cardBody":"止","cardMeaning":["Stop"],"meaningMnemonic":"There's a giant toe and a stick in the ground in front of you. You're driving your car toward them, but you don't see them until your lights hit them. What would these things cause you to do? Most likelystopyour car right away."},{"type":"radical","cardNo":112,"cardLevel":2,"cardBody":"丁","cardMeaning":["Street"],"meaningMnemonic":"There's a barb under the ground, holding it in place. This is actually astreet. All streets have to be secured to the ground with barbs so that they don't slide all over the place. If you tried to pick up the asphalt streets we have today, you'd still find barbs under the ground to keep them there. The more you know! ⭐"},{"type":"radical","cardNo":113,"cardLevel":2,"cardBody":"刀","cardMeaning":["Sword"],"meaningMnemonic":"If you look at this radical, it looks like the bottom part of asword—the handle, more specifically. This radical also looks a lot like the power radical (力), so don't get them confused. It's missing the little nubbin at the top, because 90% of the power comes from the sword to cut your enemies down (which is why the sword radical is 90% of the power radical)."},{"type":"radical","cardNo":114,"cardLevel":2,"cardBody":"千","cardMeaning":["Thousand"],"meaningMnemonic":"You're in a room, surrounded by slides. Down off the slides tumble cross after cross after cross. They're bouncing in and hitting you in the face, the arm, everywhere... With each cross comes a voice yelling, \"ONE! TWO! THREE HUNDRED! FIVE HUNDRED!\" and so on. You are worried it will never end, because you're starting to drown in the crosses. Then the voice yells out ONETHOUSANDand they stop. Still, you can't move. Think about all the numbers being called out, and keep wondering if it'll be the last one. Feel the relief you'd feel if it stops on a thousand, because you won't be buried anymore. The thousand crosses are covering you entirely, over your head, but because they're crosses you can still breathe."},{"type":"radical","cardNo":115,"cardLevel":2,"cardBody":"メ","cardMeaning":["Treasure"],"meaningMnemonic":"This radical istreasurebecause \"X marks the spot,\" as they say. Doesn't it look like the X on a pirate treasure map? You want to go find that treasure now, right?!"},{"type":"radical","cardNo":116,"cardLevel":2,"cardBody":"水","cardMeaning":["Water"],"meaningMnemonic":"There are drops of liquid coming out of both sides of this barb. You can imagine the barb being stuck into the ground then pulled out. When it is,watercomes gushing out of both sides! That's why this radical is water."},{"type":"radical","cardNo":117,"cardLevel":2,"cardBody":"白","cardMeaning":["White"],"meaningMnemonic":"Add a drop of the sun to something and it will turn itwhite. The sun is really strong, so even a single drop will burn anything white. Why do you think so many beaches are white? Even the drops of sunblock you use to stop the sun's rays is white. So when you think of sun drops, think white."},{"type":"radical","cardNo":118,"cardLevel":2,"cardBody":"文","cardMeaning":["Writing"],"meaningMnemonic":"This looks like a stool with a lid on it, but it's actually awritingdesk. Do you see it? It's a nice, quiet place for writing. You can even see the pen sticking up in the middle. Wouldn't you want to do your writing here?"},{"type":"radical","cardNo":236,"cardLevel":3,"cardBody":"矢","cardMeaning":["Arrow"],"meaningMnemonic":"You have a really big gun. Why? Because only big guns will be able to shootarrows! Bullets are pretty small, so the guns that shoot them can be any size. But you need a big gun if you want to shove an arrow in it and then shoot it at your enemies."},{"type":"radical","cardNo":237,"cardLevel":3,"cardBody":"广","cardMeaning":["Canopy"],"meaningMnemonic":"This is acanopy. See the cloth draping down and the little point at the middle holding it up? You could sit under here and enjoy a bright, summer day without getting any sun!"},{"type":"radical","cardNo":238,"cardLevel":3,"cardBody":"方","cardMeaning":["Direction"],"meaningMnemonic":"This radical looks like a dude running off to the right. He's heading in a very distinctdirection. Which direction was it again?"},{"type":"radical","cardNo":239,"cardLevel":3,"cardBody":"戸","cardMeaning":["Door"],"meaningMnemonic":"Where does a flag usually go? It goes over adoor. I know the一radical usually means ground, but in this case we're going to say the flag is in the doorway (where the一is the top of the door)."},{"type":"radical","cardNo":240,"cardLevel":3,"cardBody":"干","cardMeaning":["Dry"],"meaningMnemonic":"You have two on a stick. Two what? Well, you can't tell because they're toodry. Someone put two somethings on this stick to dry, but they seem to have left them out for way too long. Was it meat? Fish? Cucumbers? You have no clue, but they're two very dry somethings, that's for sure."},{"type":"radical","cardNo":241,"cardLevel":3,"cardBody":"父","cardMeaning":["Father"],"meaningMnemonic":"There are fins covering the treasure making up this radical. You pull away the fins and start digging where the X is (because \"X\" marks where the treasure is, right?). When you dig down, instead of finding treasure, you find yourfather. The shock of this in your imagination should help you to remember the meaning of this radical!"},{"type":"radical","cardNo":242,"cardLevel":3,"cardBody":"扌","cardMeaning":["Fingers"],"meaningMnemonic":"This looks like the hand (手) radical, but smaller. That's because it's just thefingers. You don't always have room for a whole hand to be in a kanji, but there's always space for a few fingers."},{"type":"radical","cardNo":243,"cardLevel":3,"cardBody":"毛","cardMeaning":["Fur"],"meaningMnemonic":"Do you remember the hair radical? This is like that, except now the hair is attached to a tail. Animals don't usually have hair, though. Instead, they havefur."},{"type":"radical","cardNo":244,"cardLevel":3,"cardMeaning":["Hat"],"meaningMnemonic":"Do you know those rice paddy hats? The ones shaped just like this radical? That's why this radical is ahat.","cardImg":"hat.png"},{"type":"radical","cardNo":245,"cardLevel":3,"cardBody":"心","cardMeaning":["Heart"],"meaningMnemonic":"Take a good look at this one. It kind of looks like aheart(not the stereotypical Valentine’s Day heart, though). Think of a real heart. Basically, there’s a lump (the heart) in the middle, and three lines which make up the arteries that go in and out of the heart to keep you alive. This radical shows up a lot, so it shouldn’t be too hard to learn it as you go along. Remember, lump (heart) plus arteries equals a heart… like, a real heart, not the fake, pretty kind."},{"type":"radical","cardNo":246,"cardLevel":3,"cardBody":"生","cardMeaning":["Life"],"meaningMnemonic":"This radical consists of a cow radical with the ground radical below it. If you have cows on solid ground, then you really do have a goodlife, I think. Sometimes this radical will show up without the slide part on the side too, though we'll treat them both as \"life.\""},{"type":"radical","cardNo":247,"cardLevel":3,"cardBody":"今","cardMeaning":["Now"],"meaningMnemonic":"This is a hat on top of the katakana for \"ra.\" Think of Ra, the Egyptian god. When is Ra wearing a hat? Rightnow! It's always now, because he never takes it off. No really, look it up, it's true."},{"type":"radical","cardNo":248,"cardLevel":3,"cardBody":"古","cardMeaning":["Old"],"meaningMnemonic":"You have a cross on a mouth—that's a pretty religious mouth. Who speaks the most about religion?Oldpeople, mostly. Also, think about the teachings of religion itself - also pretty old, age-wise. No matter how you look at it, everything about this radical is kind of \"old.\""},{"type":"radical","cardNo":249,"cardLevel":3,"cardBody":"元","cardMeaning":["Origin"],"meaningMnemonic":"You have two legs making up this radical. Between two legs is where you came from, no matter how you look at it. These two legs are yourorigin."},{"type":"radical","cardNo":250,"cardLevel":3,"cardBody":"幺","cardMeaning":["Poop"],"meaningMnemonic":"There's something sticking out of you while you're in private. It'spoop! You can't just poop in public, that's illegal and gross in this day and age. So the next time something starts to come out of you when you're in private, think, \"Ah yes, it's poop.\""},{"type":"radical","cardNo":251,"cardLevel":3,"cardBody":"匕","cardMeaning":["Spoon"],"meaningMnemonic":"This radical looks like aspoon! Well, a spoon that's been bent a lot by an angry person or a psychic. Go grab a spoon and try to bend it into this shape. Then hold on to it so you'll never forget that this is the spoon radical!"},{"type":"radical","cardNo":252,"cardLevel":3,"cardBody":"用","cardMeaning":["Task"],"meaningMnemonic":"This looks a bit like a calendar with spaces for you to write in yourtasks for the day. See those blank sections? Make sure you write down your daily tasks, so you don't forget to do something important!"},{"type":"radical","cardNo":253,"cardLevel":3,"cardBody":"巾","cardMeaning":["Towel"],"meaningMnemonic":"There's something draped over that stick. It's atowel!! Imagine taking a wet towel and hanging it over a railing or a stick so it won't get all musty and gross. It would look just like this."},{"type":"radical","cardNo":254,"cardLevel":3,"cardMeaning":["Triceratops"],"meaningMnemonic":"The three horns represent thetriceratops, one of the most awesome dinosaurs ever.","cardImg":"triceratops.png"},{"type":"radical","cardNo":255,"cardLevel":3,"cardBody":"夂","cardMeaning":["Winter"],"meaningMnemonic":"This looks kind of like a footprint, but not an ordinary, old footprint. A snowshoe footprint in the snow. Why? Because it'swinter! And everyone knows the snowshoe footprint is the universal symbol for winter."},{"type":"radical","cardNo":357,"cardLevel":4,"cardBody":"也","cardMeaning":["Alligator"],"meaningMnemonic":"See the mouth and teeth of thisalligator, which is facing to the right? You wouldn't want to get your hand stuck in there, that's for sure."},{"type":"radical","cardNo":358,"cardLevel":4,"cardBody":"竹","cardMeaning":["Bamboo"],"meaningMnemonic":"See how tall the stalks are with little bushy things at the top? It kind of looks likebamboo, if you use your imagination."},{"type":"radical","cardNo":359,"cardLevel":4,"cardBody":"巴","cardMeaning":["Bed"],"meaningMnemonic":"You'll have to complete the line on the right side in your mind, but see the rectanglebedand the pillows? This is totally a bed. That missing line is where you pulled back the sheets when you got up this morning."},{"type":"radical","cardNo":360,"cardLevel":4,"cardMeaning":["Beggar"],"meaningMnemonic":"Doesn't this look like someone on their knees, holding their hands out (clasped) and begging for something (money, their life, etc.)? That's why this radical is known as thebeggar.","cardImg":"beggar.png"},{"type":"radical","cardNo":361,"cardLevel":4,"cardBody":"支","cardMeaning":["Branch"],"meaningMnemonic":"There is a cross growing out of this stool. It'sbranching off of it, if you will. The tree that this stool was made of is coming back to life in the form of a branch."},{"type":"radical","cardNo":362,"cardLevel":4,"cardBody":"車","cardMeaning":["Car"],"meaningMnemonic":"Doesn't this look like a top-down view of the frame of acar? There are the rods that make up the base of the car and things for the wheels to go on. That's why this radical is the car radical."},{"type":"radical","cardNo":363,"cardLevel":4,"cardBody":"弋","cardMeaning":["Ceremony"],"meaningMnemonic":"This radical looks like a person with a long dress or train running behind them. That's because it's a bride or groom going to their weddingceremony! You usually have to wear a long dress or a cape if you're at a ceremony. So when you see this radical, think of all the different ceremonies you might have to go to in your life and what you'll need to wear."},{"type":"radical","cardNo":364,"cardLevel":4,"cardBody":"厂","cardMeaning":["Cliff"],"meaningMnemonic":"See thecliff? It's facing towards the west. What ocean is to your west? That's the direction this cliff is facing."},{"type":"radical","cardNo":365,"cardLevel":4,"cardBody":"耳","cardMeaning":["Ear"],"meaningMnemonic":"This radical is a bit more elaborate than the eye, though similar. In fact, if you go blind, yourears become one of your new senses of sight, which is why this is like another, somewhat modified, eye. You'll even notice little lines sticking out of the eye. That's because ears stick out more than eyes (目), which is why this radical is the ear radical."},{"type":"radical","cardNo":366,"cardLevel":4,"cardBody":"气","cardMeaning":["Energy"],"meaningMnemonic":"This radical is shaped kind of like a dam. See the wall and the water pushing over the top? If this radical is a dam, then it must create a ton ofenergyas well!"},{"type":"radical","cardNo":367,"cardLevel":4,"cardBody":"艹","cardMeaning":["Flowers"],"meaningMnemonic":"See the little things sticking out of the ground? Those little things are pretty littleflowers. You know they're flowers and not, say, grass, because they're spaced out. You'll learn grass later, and it will be less spaced out, but somewhat similar to this, so keep that in mind!"},{"type":"radical","cardNo":368,"cardLevel":4,"cardBody":"足","cardMeaning":["Foot"],"meaningMnemonic":"Do you see the dude doing a flying dragon kick to the right? What does he hit the target with? Obviously it's hisfoot."},{"type":"radical","cardNo":369,"cardLevel":4,"cardBody":"冖","cardMeaning":["Forehead"],"meaningMnemonic":"Sure, thisforeheadis a bit square, but that's because it's Frankenstein's Monster's forehead. Also, did you notice that this is just the top part of the head (冂) radical? This is just the forehead part of that!"},{"type":"radical","cardNo":370,"cardLevel":4,"cardMeaning":["Horns"],"meaningMnemonic":"Can you see thehorns? You could put these horns on anything. Donkeys, people, monkeys, and so on. That's exactly what we'll be doing when we learn kanji that have horns too.","cardImg":"horns.png"},{"type":"radical","cardNo":371,"cardLevel":4,"cardBody":"虫","cardMeaning":["Insect"],"meaningMnemonic":"There is something private in your mouth. You're keeping it private because you don't want other people to judge you. Why? Because it's aninsect. You like to eat insects, but society seems to think it's wrong. Don't worry, friend. Someday the rest of the world will embrace eating insects like you have."},{"type":"radical","cardNo":372,"cardLevel":4,"cardBody":"ｲ","cardMeaning":["Leader"],"meaningMnemonic":"This radical technically means person (like人), but we're going to shift the meaning a little bit. It's kind of like the person radical, but it's taller and skinnier, standing above the rest of those peons. That's why this is aleader, not a regular old person."},{"type":"radical","cardNo":373,"cardLevel":4,"cardBody":"彳","cardMeaning":["Loiter"],"meaningMnemonic":"The leader (ｲ) radical has a little something extra on top of him, holding him down, holding him back. It's causing him to wait... it's causing him toloiter."},{"type":"radical","cardNo":374,"cardLevel":4,"cardBody":"主","cardMeaning":["Master"],"meaningMnemonic":"This king has a drop of water floating above his head. That's because he's not just a king, he's themasterof water. Master of elements. Master of ALL THINGS!"},{"type":"radical","cardNo":375,"cardLevel":4,"cardBody":"寸","cardMeaning":["Measurement"],"meaningMnemonic":"Have you ever used one of those math compasses? This looks just like one of those because this is themeasurementradical. Compasses are used to measure things, just like this."},{"type":"radical","cardNo":376,"cardLevel":4,"cardBody":"不","cardMeaning":["Not"],"meaningMnemonic":"If you see this radical in a kanji, you'll want to think of the opposite of whatever other radicals there are. It looks a lot like \"below,\" but guess what? It'snotthe below radical. It's just not."},{"type":"radical","cardNo":377,"cardLevel":4,"cardBody":"兀","cardMeaning":["Pi"],"meaningMnemonic":"Obviously, this looks just like the good ol' 3.14 something-something all people are supposed to learn about. It's the math symbol that has to do with circles...pi!"},{"type":"radical","cardNo":378,"cardLevel":4,"cardBody":"皿","cardMeaning":["Plate"],"meaningMnemonic":"This is a fewplates drying on a rack. They're stacked together in a line. Imagine reaching out and grabbing one of those plates for yourself."},{"type":"radical","cardNo":379,"cardLevel":4,"cardBody":"赤","cardMeaning":["Red"],"meaningMnemonic":"There are some legs and fins under the dirt. Imagine yourself looking at all of these severed limbs... there's blood everywhere. No matter how deep you dig, everything is stainedred."},{"type":"radical","cardNo":380,"cardLevel":4,"cardBody":"米","cardMeaning":["Rice"],"meaningMnemonic":"Not to be confused with a rice paddy (田). This is just rawrice, like the grain that grows out of the ground when rice is raw and fresh. When rice is particularly ripe, it'll kind of look like this at the top of the stalks. See the long leaves with the little rice tufts at the top? That's why this radical is \"rice.\""},{"type":"radical","cardNo":381,"cardLevel":4,"cardBody":"宀","cardMeaning":["Roof"],"meaningMnemonic":"This is aroof. You know it's a roof and not a forehead because there's a little chimney sticking out of the top. And foreheads definitely don't have chimneys."},{"type":"radical","cardNo":382,"cardLevel":4,"cardBody":"士","cardMeaning":["Samurai"],"meaningMnemonic":"Thesamurairadical looks a lot like the dirt radical. The difference is in the top horizontal line. For samurai, the top is longer because he's holding swords. Dirt can't really hold anything because its arms are too short. So when you see this radical, think: long arms for some long swords. That's a samurai!"},{"type":"radical","cardNo":383,"cardLevel":4,"cardBody":"見","cardMeaning":["See"],"meaningMnemonic":"There's an eyeball on top of some legs. When your eyes get taken places (on legs, in this case), your eyes areseeing those things. That's why this radical means see."},{"type":"radical","cardNo":384,"cardLevel":4,"cardBody":"貝","cardMeaning":["Shellfish"],"meaningMnemonic":"There's a giant eye on top of some fins. Imagine this giant eye to be on top of a clam or a mussel. It has little fins, which it runs around on, escaping from your every attempt to capture it. That's why this is theshellfishradical."},{"type":"radical","cardNo":385,"cardLevel":4,"cardMeaning":["Spikes"],"meaningMnemonic":"On the ground there are a bunch ofspikescoming out. You wouldn't want to step on those now, would you?","cardImg":"spikes.png"},{"type":"radical","cardNo":386,"cardLevel":4,"cardBody":"ネ","cardMeaning":["Spirit"],"meaningMnemonic":"This looks just like the katakana character for ne. Ne for necromancer! That makes this aspirit, brought back from the grave. OooooOOoooOoo!"},{"type":"radical","cardNo":387,"cardLevel":4,"cardBody":"糸","cardMeaning":["Thread"],"meaningMnemonic":"There is something small in some poop. You lean in, carefully pull it out, and realize it's athread. Why is there some thread in this small poop? Because it's cat poop. And cats love to eat thread when you aren't looking. And floss and hoodie strings and mouse tails. But this poop just has thread in it."},{"type":"radical","cardNo":388,"cardLevel":4,"cardBody":"乚","cardMeaning":["Umbrella"],"meaningMnemonic":"Do you know how the bottom of anumbrellais shaped? It has a hook that curls around for the handle. So when you see this radical, you should think of the bottom of an umbrella, which will help you remember that it means umbrella."},{"type":"radical","cardNo":389,"cardLevel":4,"cardBody":"世","cardMeaning":["World"],"meaningMnemonic":"There are no circles in kanji, remember? So imagine that these angles are really circles. A little circle in a big circle, with a line running through them. Why, it's theworld. The world looks just like this, with continents on the globe and a line is the equator. Can you see it?"},{"type":"radical","cardNo":541,"cardLevel":5,"cardBody":"斤","cardMeaning":["Axe"],"meaningMnemonic":"This is a strange looking axe, I know. But think of it this way: the letter \"T\" is in the cliff. What is the \"T\"? Of course it has to be Mr. T, who's super awesome. Think of Mr. T wielding a terrifying axe, running after you screaming, \"I pity the fool!\" while trying to chop you down. That makes for a pretty terrifyingaxe."},{"type":"radical","cardNo":542,"cardLevel":5,"cardBody":"青","cardMeaning":["Blue"],"meaningMnemonic":"You have life on top of the moon (ignore that life is missing its little slide on the left side). What would life on the moon look like? Well, first of all, they have no air, so they probably look prettybluefrom asphyxiation. When you meet them, it turns out you're right. They're a civilization of blue people. Imagine them all living up there, being blue and Smurfy."},{"type":"radical","cardNo":543,"cardLevel":5,"cardBody":"耂","cardMeaning":["Coffin"],"meaningMnemonic":"See the slide going into the dirt? That's where they throw your body when you die. It's actually acoffin!"},{"type":"radical","cardNo":544,"cardLevel":5,"cardBody":"色","cardMeaning":["Color"],"meaningMnemonic":"The bed you get in prison is the only thing withcoloryou'll see while you're there. Picture a dark, dank cell. Maybe a toilet too. Now picture a bright, colorful bed against the wall. This is the only joy you have."},{"type":"radical","cardNo":545,"cardLevel":5,"cardBody":"羽","cardMeaning":["Feathers"],"meaningMnemonic":"This radical already looks like a pair of wings, right? What are on wings? Well, usually lots offeathers."},{"type":"radical","cardNo":546,"cardLevel":5,"cardBody":"行","cardMeaning":["Go"],"meaningMnemonic":"You have the radicals for loiter, two, and barb. Someone who uses two barbs on you while you're loitering really wants you toGO!! GO on, stop loitering outside of my convenience store, ya dang kids!"},{"type":"radical","cardNo":547,"cardLevel":5,"cardBody":"金","cardMeaning":["Gold"],"meaningMnemonic":"There's two sets of spikes underneath that hat. It's actually a trap, to prevent anyone from coming in and stealing yourgold. Why else would you make a trap? Everyone likes to protect their gold."},{"type":"radical","cardNo":548,"cardLevel":5,"cardBody":"冫","cardMeaning":["Ice"],"meaningMnemonic":"Remember the radical for drop (of liquid)? This is two drops instead of one. When you see two drops, you should think, \"the next stage of water.\" What is the next stage? Why, that isice."},{"type":"radical","cardNo":549,"cardLevel":5,"cardBody":"乍","cardMeaning":["Key"],"meaningMnemonic":"This is a very oddly shapedkey, but it's a key nonetheless."},{"type":"radical","cardNo":550,"cardLevel":5,"cardMeaning":["Kick"],"meaningMnemonic":"These are legs that are bending funny. They're bending so they cankickyou! Imagine someone doing a flying kick at you. Look at their legs and, ah yes, it looks just like this!","cardImg":"kick.png"},{"type":"radical","cardNo":551,"cardLevel":5,"cardBody":"开","cardMeaning":["Lantern"],"meaningMnemonic":"Think of an old-stylelantern. It's on top of a few legs (you can only see two from this angle) and it's in a box shaped holder at the top. You can imagine these lining the streets before electricity, right? That's why this radical is a lantern."},{"type":"radical","cardNo":552,"cardLevel":5,"cardBody":"可","cardMeaning":["Lip Ring"],"meaningMnemonic":"There's something hooked going into a mouth. Rather than a hook, though, it's alip ring. They used to use fish hooks and nails in the old days. (Glad we don't live in those times anymore!)"},{"type":"radical","cardNo":553,"cardLevel":5,"cardBody":"肉","cardMeaning":["Meat"],"meaningMnemonic":"Inside your head, you can only think about people, people, and more people. This is bad, because really all you want is theirmeat, because you're some kind of sick cannibal... you monster. When you think of \"people\" in your head, you're really just thinking about more meat you can eat."},{"type":"radical","cardNo":554,"cardLevel":5,"cardBody":"会","cardMeaning":["Meet"],"meaningMnemonic":"Under the hat there are two peoplemeeting in private. Look at them huddled up in there. They must have a reason to want to meet in such a private place, but that's not for you to judge. Maybe next time you have to meet with someone you'll hide under a hat with them too."},{"type":"radical","cardNo":555,"cardLevel":5,"cardBody":"冋","cardMeaning":["Mustache"],"meaningMnemonic":"See themustachegoing around the mouth? I wish I could grow a sweet mustache like this."},{"type":"radical","cardNo":556,"cardLevel":5,"cardBody":"雨","cardMeaning":["Rain"],"meaningMnemonic":"The towel is getting soaked with drops of liquid. That's because it'sraining. Get your towels and other clothes inside before they get soaked through from this rain!"},{"type":"radical","cardNo":557,"cardLevel":5,"cardBody":"走","cardMeaning":["Run"],"meaningMnemonic":"See the personrunning? Don't confuse this with foot (足), though. The head is just a streak because this person is running so fast."},{"type":"radical","cardNo":558,"cardLevel":5,"cardBody":"言","cardMeaning":["Say"],"meaningMnemonic":"There are a bunch of sound waves coming out of a mouth. Those waves represent the things yousay."},{"type":"radical","cardNo":559,"cardLevel":5,"cardMeaning":["Scooter"],"meaningMnemonic":"This radical is ascooter. See the handlebars and the little light? And there's a platform at the bottom you can stand or sit on (if it's one of those nice motorized ones).","cardImg":"scooter.png"},{"type":"radical","cardNo":560,"cardLevel":5,"cardBody":"自","cardMeaning":["Self"],"meaningMnemonic":"That little fleck / drop on your eye is what makes you unique. It's what makes you yourself. It's you, you know?"},{"type":"radical","cardNo":561,"cardLevel":5,"cardBody":"氵","cardMeaning":["Tsunami"],"meaningMnemonic":"You've seen one drop (丶), but what happens when you triple this and have three drops, which happens to be the maximum number of drops you can have? You end up with a devastatingtsunami, because there's too much water and nowhere for it to go. Just think of this as a lot of water. When you have a lot of water, you have a tsunami."},{"type":"radical","cardNo":562,"cardLevel":5,"cardBody":"廾","cardMeaning":["Twenty"],"meaningMnemonic":"You have十plus十... what do you get when you add these two kanji together? You gettwenty."},{"type":"radical","cardNo":563,"cardLevel":5,"cardMeaning":["Viking"],"meaningMnemonic":"This is a roof with extra spikes / horns on it. Who was famous for having spiked roofs, spiked helmets, spiked boats?! The Vikings! That's why this is theVikingradical.","cardImg":"viking.png"},{"type":"radical","cardNo":564,"cardLevel":5,"cardBody":"里","cardMeaning":["Village"],"meaningMnemonic":"This is a rice paddy with dirt around it. This is the perfect place to set up avillage. You have a place to farm and some dirt to live on. What else could you need?"},{"type":"radical","cardNo":565,"cardLevel":5,"cardBody":"西","cardMeaning":["West"],"meaningMnemonic":"You have pi coming out of a mouth. \"3.14,\" it says. We must take the secret of the circle with us, away from here. We must go to a magical place where nobody will persecute us for our math... a place to theWest!"},{"type":"radical","cardNo":566,"cardLevel":5,"cardBody":"毋","cardMeaning":["Window"],"meaningMnemonic":"See the criss-cross in the pseudo-square shape? That's the frames of a bigwindowyou can look out of. It's not perfectly shaped like a rice field, it's more artistic. That's why this is a window and田is not."},{"type":"radical","cardNo":567,"cardLevel":5,"cardBody":"ヨ","cardMeaning":["Wolverine"],"meaningMnemonic":"You knowWolverinefrom the X-Men? He has three claws that come out of his hand whenever he needs to fight, not at all unlike the radical you see here."},{"type":"radical","cardNo":735,"cardLevel":6,"cardBody":"ホ","cardMeaning":["Angel"],"meaningMnemonic":"First of all, there's a cross making up the middle, which automatically makes this a religion-based radical. That cross is the frame of someone's body and the things coming off of it are wings. This is anangel."},{"type":"radical","cardNo":736,"cardLevel":6,"cardBody":"犭","cardMeaning":["Animal"],"meaningMnemonic":"This looks like a tail with some hairs coming off of it. It shouldn't be confused with fingers though, because it's curved, and the things sticking out are more erratic, like hair or fur would be. That's why this radical is theanimalradical."},{"type":"radical","cardNo":737,"cardLevel":6,"cardBody":"血","cardMeaning":["Blood"],"meaningMnemonic":"There's a little speck of something on your plate (皿). \"What is that?\" you ask. Oh no... that speck isBLOOD!!! I hope it's blood from a nosebleed you suddenly have and not someone else's blood. (Your waiter is probably gonna get fired, btw.) At least your platelets should stop the bleeding soon. Haha, get it? PLATE-lets? Japanese blood jokes."},{"type":"radical","cardNo":738,"cardLevel":6,"cardBody":"灬","cardMeaning":["Boil"],"meaningMnemonic":"This radical looks like the fire from the burner of a stove or the steam coming up off of a pot of water. That's because this is theboilradical. You need to boil a bunch of water over some flames. This radical looks like all of those parts at once!"},{"type":"radical","cardNo":739,"cardLevel":6,"cardBody":"凵","cardMeaning":["Box"],"meaningMnemonic":"Thisboxis open. There could be any number of things inside, but for now all you need to know is the meaning of this radical, which is box."},{"type":"radical","cardNo":740,"cardLevel":6,"cardBody":"市","cardMeaning":["City"],"meaningMnemonic":"You already learned the kanji市, which means city. We're treating it as a radical too, since it pops up in many other kanji. When used as a radical, it still meanscity."},{"type":"radical","cardNo":741,"cardLevel":6,"cardBody":"亡","cardMeaning":["Death"],"meaningMnemonic":"There's a lid on a lion. And you're stuck under the lid with the lion, which means you will surely meet yourdeath. Or if you don't want to die, think of the poor lion. If you leave a lion under a lid for too long, death will come for it too. Either way, somebody's gonna die today."},{"type":"radical","cardNo":742,"cardLevel":6,"cardBody":"食","cardMeaning":["Eat"],"meaningMnemonic":"You put on your hat and go outside to kick something white. It's a big white goose and you killed it with your kick. That's because you're going to cook andeatit. Yum!"},{"type":"radical","cardNo":743,"cardLevel":6,"cardBody":"占","cardMeaning":["Fortune"],"meaningMnemonic":"Someone has a toe in their mouth. They are a fortune teller telling yourfortune. But for her to do it, she has to take one of your toes and taste it. This better be a good fortune for you to let someone put your foot in their mouth."},{"type":"radical","cardNo":744,"cardLevel":6,"cardBody":"禾","cardMeaning":["Grain"],"meaningMnemonic":"This is a tree with a slide cutting off the top. What do you cut off the top of trees and plants? Thegrains. Imagine taking a sickle and slicing the grains off rice or wheat. The plant you leave behind will look like this radical. It's a sign that you got a grain of some sort from it."},{"type":"radical","cardNo":745,"cardLevel":6,"cardBody":"未","cardMeaning":["Jet"],"meaningMnemonic":"This is like one of thosejets that have the little nose-wings going on too. Imagine you're looking at the jet from the top down, this is what it would look like. It's also why this is the jet radical."},{"type":"radical","cardNo":746,"cardLevel":6,"cardBody":"刂","cardMeaning":["Knife"],"meaningMnemonic":"This is aknife. See how it has two sharp sides? And there's a little handle at the bottom for the... well the handle. Be careful you don't cut yourself!"},{"type":"radical","cardNo":747,"cardLevel":6,"cardBody":"欠","cardMeaning":["Lack"],"meaningMnemonic":"There's a person in a prison. Why is this person in prison? Because theylackthe stuff humans need to be around other humans. If you're lacking something (kindness, self-control, etc.) you may do something that makes other people put you in prison. Try to fix what you lack so this won't happen to you."},{"type":"radical","cardNo":748,"cardLevel":6,"cardBody":"斗","cardMeaning":["Ladle"],"meaningMnemonic":"There's aladlescooping up two drops of liquid. See the handle and the scoop part of the ladle? Imagine ladling some water into your mouth. Mmm."},{"type":"radical","cardNo":749,"cardLevel":6,"cardBody":"L","cardMeaning":["Lion"],"meaningMnemonic":"This L-shaped radical is thelionradical, because \"L is for Lion.\" It also looks like a lion's mouth being opened really, really wide. Imagine a lion opening its mouth to yawn. It looks like this radical!"},{"type":"radical","cardNo":750,"cardLevel":6,"cardBody":"長","cardMeaning":["Long"],"meaningMnemonic":"You have a modified key radical on top of the kick radical. You kick the key as far as you can, then measure the distance. Howlongdid it travel? How long will it take you to find it? How long will you be in trouble for kicking a key into the woods?"},{"type":"radical","cardNo":751,"cardLevel":6,"cardBody":"マ","cardMeaning":["Mama"],"meaningMnemonic":"This radical is just like the katakana character \"ma\" (マ). So let's keep things simple and make the radicalmama."},{"type":"radical","cardNo":752,"cardLevel":6,"cardBody":"首","cardMeaning":["Neck"],"meaningMnemonic":"There are some horns on the ground that you want for yourself. You pick them up and you attach them to yourneck. Imagine these horns sticking out of your neck. No one can slit your throat now that your neck is protected."},{"type":"radical","cardNo":753,"cardLevel":6,"cardBody":"羊","cardMeaning":["Sheep"],"meaningMnemonic":"This is asheepand you're looking at it from above. See the two ears and the body of the sheep going back (with all its wool poking out to the side) and then the little tail sticking out the back. What a cute sheep!"},{"type":"radical","cardNo":754,"cardLevel":6,"cardBody":"舌","cardMeaning":["Tongue"],"meaningMnemonic":"Something is sticking out of a mouth. Something with a thousand little tastebuds on it. It's yourtongue!"},{"type":"radical","cardNo":755,"cardLevel":6,"cardBody":"歹","cardMeaning":["Yakuza"],"meaningMnemonic":"The evening radical is under the ground. Who's doing things underground at night? TheYakuza. Picture Yakuza members sneaking around in the subway, or in the sewers. They're definitely up to no good down there."},{"type":"radical","cardNo":922,"cardLevel":7,"cardBody":"鳥","cardMeaning":["Bird"],"meaningMnemonic":"See the cool wing on the bottom? See the head with the neat feather coming out of the top? This is abird. Tweet tweet!"},{"type":"radical","cardNo":923,"cardLevel":7,"cardBody":"黒","cardMeaning":["Black"],"meaningMnemonic":"If you boil a village everything will turnblack. Mostly because you're a crazed murderer, but more so because when you boil a village all the roads melt and coat everything in black tar. Picture it! It looks like Pompeii. (Oof, too soon?)"},{"type":"radical","cardNo":924,"cardLevel":7,"cardBody":"舟","cardMeaning":["Boat"],"meaningMnemonic":"This looks like aboatcoming toward you in the water. See the billowing sail and the reflection off the water? That's what boats look like."},{"type":"radical","cardNo":925,"cardLevel":7,"cardBody":"周","cardMeaning":["Circumference"],"meaningMnemonic":"Put some dirt around your head and in your mouth to figure out your head'scircumference. When you pull your head out you'll have the perfect shape of your head, making measuring the circumference easy. Oh, and the dirt in your mouth? That's just for the taste."},{"type":"radical","cardNo":926,"cardLevel":7,"cardBody":"氏","cardMeaning":["Clan"],"meaningMnemonic":"This looks like a little tamagotchi or (if you aren't a 90s kid) a duck. What do both of these critters have in common? They have really crazyclanfollowings. And the people who enjoy them (tiny pocket games or watching quacking duckies) create clans that get together and share their experiences. Which clan are you a part of?"},{"type":"radical","cardNo":927,"cardLevel":7,"cardBody":"魚","cardMeaning":["Fish"],"meaningMnemonic":"In a prison on a rice paddy they're boiling something. What do you think it is?Fish!. What goes better with rice? What's easy to find, making it cheap prison food? Fish, of course!"},{"type":"radical","cardNo":928,"cardLevel":7,"cardBody":"門","cardMeaning":["Gate"],"meaningMnemonic":"This radical already looks like agate, right? Just imagine a big gate with two pillars, one on either side. Then, up above are the doors, which can come down at any moment."},{"type":"radical","cardNo":929,"cardLevel":7,"cardBody":"夫","cardMeaning":["Husband"],"meaningMnemonic":"The radicals ground and big make up this radical. There's a big guy on the ground... who is that big guy? Embarrassingly, it's yourhusband. Feel the shame that he got knocked down on the ground. By what? Who? How? (It doesn't matter.)"},{"type":"radical","cardNo":930,"cardLevel":7,"cardBody":"己","cardMeaning":["Oneself"],"meaningMnemonic":"This looks a bit like a backwards S. S for Self. But it's backwards because you didn't want to mix yourself up with any of the other selves out there, so you flipped it. That's why it meansoneself. (That's you!)This radical will appear as things like yourself, herself, etc., so keep that in mind!"},{"type":"radical","cardNo":931,"cardLevel":7,"cardBody":"豕","cardMeaning":["Pig"],"meaningMnemonic":"You have the animal radical in this already, that should be a clue. What kind of animal is it? It's in the ground, covered in mud. Also, there are toes laying around with it, because this animal will eat anything (good way to get rid of bodies... I hear). So what's this animal that's covered in mud and eats toes because it will eat anything? It's apig!"},{"type":"radical","cardNo":932,"cardLevel":7,"cardBody":"矛","cardMeaning":["Spear"],"meaningMnemonic":"Your mama has been impaled on something! You run toward her and see that she's been impaled on aspear. Mama, no!"},{"type":"radical","cardNo":933,"cardLevel":7,"cardBody":"卩","cardMeaning":["Stamp"],"meaningMnemonic":"This radical looks a little like the letter P, right? It's a P printed onto something... wait, it's not printed, it's astampthat's been put on the paper. Peter Parker likes to use stamps instead of pens."},{"type":"radical","cardNo":934,"cardLevel":7,"cardBody":"几","cardMeaning":["Table"],"meaningMnemonic":"What happens when you put a flat surface on top of a pair of legs? You get atable."},{"type":"radical","cardNo":935,"cardLevel":7,"cardBody":"孝","cardMeaning":["Teacher"],"meaningMnemonic":"This radical is made up of coffin and child. To keep a child out of a coffin they'll need a goodteacherto make sure they know not to stick forks in outlets or dance in traffic. That's why this radical is a teacher."},{"type":"radical","cardNo":936,"cardLevel":7,"cardBody":"寺","cardMeaning":["Temple"],"meaningMnemonic":"This radical looks kind of like atempleon a hill, don't you think? With all the layers, n' stuff? Just picture that first horizontal line as the base of the ornate temple balancing on that hill underneath it and you'll have no problem remembering this radical."},{"type":"radical","cardNo":937,"cardLevel":7,"cardBody":"且","cardMeaning":["Top Hat"],"meaningMnemonic":"This radical looks just like a top hat. That's why it'stop hat!"},{"type":"radical","cardNo":938,"cardLevel":7,"cardBody":"勿","cardMeaning":["Wing"],"meaningMnemonic":"See thewing? It's kind of like a bat wing with webbing. Either way, it's just a wing."},{"type":"radical","cardNo":939,"cardLevel":7,"cardBody":"黄","cardMeaning":["Yellow"],"meaningMnemonic":"Flowers that grow out of the ground of a rice paddy after you bury fins there will growyellow. Why? Because yellow is the color of a fish's soul, so planting flowers over their fins will turn them into a nice, pretty yellow."},{"type":"radical","cardNo":1078,"cardLevel":8,"cardBody":"匚","cardMeaning":["Cage"],"meaningMnemonic":"This radical is acagebecause it's covered on all sides but one (the one open side is where the cage door or gate is). There's nothing inside this cage because there's no gate, and whatever was inside has gotten out. I hope it wasn't rabid..."},{"type":"radical","cardNo":1079,"cardLevel":8,"cardMeaning":["Cape"],"meaningMnemonic":"This is acape, like the kind a superhero would wear. See how it's hanging to the side? Imagine tying it around your neck and running around so it flies behind you.","cardImg":"cape.png"},{"type":"radical","cardNo":1080,"cardLevel":8,"cardBody":"云","cardMeaning":["Cloud"],"meaningMnemonic":"This is the radical forcloud. See how the cloud is puffy on the bottom but has two lines up top? That's because a plane flew through it. If humans didn't invent planes, this cloud radical might look different. Really makes you think, huh?"},{"type":"radical","cardNo":1081,"cardLevel":8,"cardBody":"比","cardMeaning":["Compare"],"meaningMnemonic":"This radical is made up of two slightly different versions of the spoon radical (which you should already know). Look closely at these two spoons.Comparetheir differences. Like one of those magazines where you compare two similar pictures. But this time it's with spoons."},{"type":"radical","cardNo":1082,"cardLevel":8,"cardBody":"易","cardMeaning":["Easy"],"meaningMnemonic":"If you have wings, flying to the sun will beeasy. If you try to get there with your wingless, human-body it will not be so easy."},{"type":"radical","cardNo":1083,"cardLevel":8,"cardBody":"穴","cardMeaning":["Hole"],"meaningMnemonic":"You have a roof on top of what looks like a volcano. What is the roof covering on the top of the volcano? Why, it's definitely covering theholeat the top. I guess someone thought if they built a roof on the volcano hole, none of the lava could come out."},{"type":"radical","cardNo":1084,"cardLevel":8,"cardBody":"ユ","cardMeaning":["Hook"],"meaningMnemonic":"There's a flat line for where the hand was cut off. In it is ahooklike a pirate might have. Yarrrr."},{"type":"radical","cardNo":1085,"cardLevel":8,"cardBody":"馬","cardMeaning":["Horse"],"meaningMnemonic":"Don't confuse this radical with the bird鳥radical. It looks similar, with the wing on the bottom and the shape on top, but it doesn't have a feather sticking out of the top of its head and it has a long, thick neck. So while it moves fast like it has wings, it's no bird, it's ahorse."},{"type":"radical","cardNo":1086,"cardLevel":8,"cardBody":"罒","cardMeaning":["Net"],"meaningMnemonic":"This is anet, spread out over the water. Imagine all the fish you can catch in this net!"},{"type":"radical","cardNo":1087,"cardLevel":8,"cardBody":"釆","cardMeaning":["Sickle"],"meaningMnemonic":"Most of this radical is just the rice radical, but the top part is something coming to cut the rice from its stalk. That, my friend, is thesickle. See how the rice is still there? That's because it's in motion. The sickle is literally doing the cutting RIGHT NOW! (And don't confuse this with the grain禾radical!)"},{"type":"radical","cardNo":1088,"cardLevel":8,"cardBody":"巳","cardMeaning":["Snake"],"meaningMnemonic":"There's two ways to remember this one. First, you could look at this and see it's a coiled upsnake. Or, if you want, you can imagine it as a snake head, with its face facing to the right (see its open mouth?). We may use either when learning a kanji, but for now you can pick the one that fits best with your memorization style. Just make sure you get to snake when you see this radical.*Also note that sometimes the coil isn't totally completed (where it connects in the middle of the vertical line)."},{"type":"radical","cardNo":1089,"cardLevel":8,"cardBody":"合","cardMeaning":["Suit"],"meaningMnemonic":"You find a hat on the ground with a mouth as the design on the front. You think it looks weird, but when you put it on, you find itsuits you quite well. Imagine yourself feeling not so sure about this hat at first. But, once you put it on, you feel pleasantly surprised."},{"type":"radical","cardNo":1090,"cardLevel":8,"cardBody":"殳","cardMeaning":["Weapon"],"meaningMnemonic":"Stick a table on top of a stool and you end up with a very dangerousweapon. Imagine hitting someone with this thing! Or, even better, imagine making someone sit on it. They'd be crushed mentally and emotionally and whatnot. Now that's a scary weapon."},{"type":"radical","cardNo":1257,"cardLevel":9,"cardBody":"反","cardMeaning":["Anti"],"meaningMnemonic":"This radical is the same as the kanji. It meansanti."},{"type":"radical","cardNo":1258,"cardLevel":9,"cardBody":"聿","cardMeaning":["Brush"],"meaningMnemonic":"It's easier to imagine if you turn your head sideways. The left side of this radical is thebrush. See all the bristles?"},{"type":"radical","cardNo":1259,"cardLevel":9,"cardBody":"阝","cardMeaning":["Building"],"meaningMnemonic":"This radical looks like a curvy letter B. What does B stand for?Building! This radical is used in a lot of kanji to mark that it's a building, or that it has something to do with buildings."},{"type":"radical","cardNo":1260,"cardLevel":9,"cardMeaning":["Cleat"],"meaningMnemonic":"There's the bottom of the shoe and the spikes coming out of it. Only one kind of shoe is like this, and that is acleat.","cardImg":"cleat.png"},{"type":"radical","cardNo":1261,"cardLevel":9,"cardBody":"咅","cardMeaning":["Clown"],"meaningMnemonic":"Clowns do weird tricks. One trick they might do is stand on their mouth (or stand on someone else's mouth). Imagine a clown doing either one of these things to remember this radical: clown."},{"type":"radical","cardNo":1262,"cardLevel":9,"cardBody":"疋","cardMeaning":["Coat Rack"],"meaningMnemonic":"See all the arms sticking out of this radical? Those are for hanging lots of hats and scarves and coats on because it's acoat rack."},{"type":"radical","cardNo":1263,"cardLevel":9,"cardBody":"正","cardMeaning":["Correct"],"meaningMnemonic":"This radical is the same as the kanji. It meanscorrect."},{"type":"radical","cardNo":1264,"cardLevel":9,"cardBody":"永","cardMeaning":["Eternity"],"meaningMnemonic":"A drop of water will last for aneternity. Do you remember learning about the water cycle in school? A single drop of water can recycle itself this way for all eternity!"},{"type":"radical","cardNo":1265,"cardLevel":9,"cardMeaning":["Gladiator"],"meaningMnemonic":"Someone shoved horns down onto your husband and said he has to fight for them now. They turned him into agladiator! Now your husband has to fight for their amusement. Oh no!","cardImg":"gladiator.png"},{"type":"radical","cardNo":1266,"cardLevel":9,"cardBody":"重","cardMeaning":["Heavy"],"meaningMnemonic":"This radical is made up of a thousand villages. If you tried to lift them, what would it be?Heavy! And probably crazy. But just remember how heavy a thousand villages would be."},{"type":"radical","cardNo":1267,"cardLevel":9,"cardBody":"覀","cardMeaning":["Helicopter"],"meaningMnemonic":"This radical looks like ahelicoptercoming straight at you, doesn't it? You can't see the tail part because it's behind the bigger front cab of the helicopter. But you can see the windows and the big spinning blade on top from here."},{"type":"radical","cardNo":1268,"cardLevel":9,"cardBody":"史","cardMeaning":["History"],"meaningMnemonic":"A mouth that's talking about treasure... that sounds more like ancienthistoryto me. Just because there was treasure buried all over the place back in history, doesn't mean it wasn't found by now. Don't let history take over your life, like it has the person who owns this mouth."},{"type":"radical","cardNo":1269,"cardLevel":9,"cardBody":"介","cardMeaning":["Jammed In"],"meaningMnemonic":"This radical kind of looks like an arrow, but not an ordinary one. It's curvy and forced, right? Like it's trying to tell you something is beingjammed into wherever it's pointing."},{"type":"radical","cardNo":1270,"cardLevel":9,"cardBody":"台","cardMeaning":["Machine"],"meaningMnemonic":"This radical is the same as the kanji. It meansmachine."},{"type":"radical","cardNo":1271,"cardLevel":9,"cardMeaning":["Pope"],"meaningMnemonic":"Someone has crosses for eyes. That would have to be a really devout Catholic. Who's number one in that field? That would be thePope.","cardImg":"pope.png"},{"type":"radical","cardNo":1272,"cardLevel":9,"cardBody":"辛","cardMeaning":["Spicy"],"meaningMnemonic":"You're standing up on top of a cross. Why? Because you ate something sospicythat it caused you to beg Jesus for mercy. You need to save your mouth from the spicy flames. To make sure he hears you, you stand up on the closest cross. Make sure to feel how spicy this is in your mouth to remember it better!"},{"type":"radical","cardNo":1273,"cardLevel":9,"cardMeaning":["Spring"],"meaningMnemonic":"This radical looks like some new plants pushing their way up and out of the soil. That's because this is thespringradical. Spring is the season (and the radical) full of new, growing life!","cardImg":"spring.png"},{"type":"radical","cardNo":1274,"cardLevel":9,"cardMeaning":["Squid"],"meaningMnemonic":"See thesquidshape here? There's its head, its body, and its tentacles (two, anyway). Pretty squid-like if you ask me!","cardImg":"squid.png"},{"type":"radical","cardNo":1275,"cardLevel":9,"cardBody":"癶","cardMeaning":["Tent"],"meaningMnemonic":"Kind of a strangetent, I'll admit, but one that will protect you from things trying to get in (that's why it has all the spikes). It's the best you can do, considering you're in a cloth/plastic building."},{"type":"radical","cardNo":1276,"cardLevel":9,"cardMeaning":["Yurt"],"meaningMnemonic":"There's a canopy with a little table and seats inside. This is ayurt! It may look like a canopy at first, but when you go inside it has a bunch of nice furniture for you to relax on.","cardImg":"yurt.png"},{"type":"radical","cardNo":1434,"cardLevel":10,"cardBody":"酉","cardMeaning":["Alcohol"],"meaningMnemonic":"See the west radical on top of the mouth radical? Think of the mouth of someone from the wild west (like in a cowboy movie). What is always in their mouth? It'salcohol."},{"type":"radical","cardNo":1435,"cardLevel":10,"cardBody":"豆","cardMeaning":["Beans"],"meaningMnemonic":"This radical has a pod (the square in the middle) between the ground and some roots. That pod is going to turn into a plant someday. What plant will it be? Great bigbeans, like the ones from Jack and the Beanstalk."},{"type":"radical","cardNo":1436,"cardLevel":10,"cardBody":"束","cardMeaning":["Bundle"],"meaningMnemonic":"This is a tree with something wrapped around its middle, holding it tight. If you unwrapped that middle part you'd realize it's actually a bunch of trees tied in there. It's abundleof trees!"},{"type":"radical","cardNo":1437,"cardLevel":10,"cardMeaning":["Chinese"],"meaningMnemonic":"Why is your husband putting flowers in his mouth? It's because he'sChinese. It's just something they do over there, you explain. Tea is flower water, this isn't that weird. Chinese people just thought of doing it first.","cardImg":"chinese.png"},{"type":"radical","cardNo":1438,"cardLevel":10,"cardBody":"丙","cardMeaning":["Dynamite"],"meaningMnemonic":"Doesn't this radical look like one of those old-fashioneddynamiteplunger things that gets pushed to set the fuse? That makes this dynamite!"},{"type":"radical","cardNo":1439,"cardLevel":10,"cardBody":"失","cardMeaning":["Fault"],"meaningMnemonic":"This radical is the same as the kanji. It meansfault."},{"type":"radical","cardNo":1440,"cardLevel":10,"cardBody":"頁","cardMeaning":["Geoduck"],"meaningMnemonic":"This radical consists of a shellfish with a leaf on it. What is it? The mysteriousgeoduck. It's a very distinct clam-like creature. If you don't know what a geoduck is, look it up. It's quite bizarre. It has a long, leaf-shaped protrusion coming out of its shell body."},{"type":"radical","cardNo":1441,"cardLevel":10,"cardBody":"各","cardMeaning":["Kiss"],"meaningMnemonic":"When you combine winter and mouth you get... winter mouth! Or at least a mouth that tastes like winter because it's coming in for akiss. Before you go kissing people you eat mints, right? It's common courtesy so you don't give them a mouth full of bad breath. So when you think of a winter mouth, think of a nice, minty kiss!"},{"type":"radical","cardNo":1442,"cardLevel":10,"cardBody":"辰","cardMeaning":["Landslide"],"meaningMnemonic":"If you kick a cliff you'll start alandslide! Oh no!"},{"type":"radical","cardNo":1443,"cardLevel":10,"cardBody":"曲","cardMeaning":["Music"],"meaningMnemonic":"This radical is the same as the kanji. It meansmusic."},{"type":"radical","cardNo":1444,"cardLevel":10,"cardBody":"売","cardMeaning":["Sell"],"meaningMnemonic":"This radical is the same as the kanji. It meanssell."},{"type":"radical","cardNo":1445,"cardLevel":10,"cardBody":"疒","cardMeaning":["Sick"],"meaningMnemonic":"This is the canopy radical with ice running down the back. If you hang out in a cold canopy like this you'll definitely getsick. Imagine being sick and alone inside a cold canopy. Brrrr, oh no... ACHOO!"},{"type":"radical","cardNo":1446,"cardLevel":10,"cardBody":"乃","cardMeaning":["Stairs"],"meaningMnemonic":"See thestairsshape on the right side? Also note it's being held up by a pillar or beam or something, to make sure the stairs don't just collapse as you walk up them."},{"type":"radical","cardNo":1447,"cardLevel":10,"cardBody":"圣","cardMeaning":["Tombstone"],"meaningMnemonic":"There is a stool sticking out of the dirt. You walk up and realize it has writing on it. It's actually atombstone. You can sit on it and remember the people who are below the dirt now."},{"type":"radical","cardNo":1448,"cardLevel":10,"cardBody":"隹","cardMeaning":["Turkey"],"meaningMnemonic":"This looks kind of like the top of the bird radical, but not quite. It's kind of a dumb-looking bird radical top. What's a dumb bird, so dumb that it would look into the sky to drown itself with its mouth open? Aturkey."},{"type":"radical","cardNo":1608,"cardLevel":11,"cardMeaning":["Bear"],"meaningMnemonic":"This looks like the letter \"B\" which stands forbear. B for Bear! The letter B also looks a bit like a bear, if you think about it.","cardImg":"bear.png"},{"type":"radical","cardNo":1609,"cardLevel":11,"cardMeaning":["Blackjack"],"meaningMnemonic":"You have the radical twenty and the kanji one. Put those together and you get 21. What's another name for 21? That'sblackjack.","cardImg":"blackjack.png"},{"type":"radical","cardNo":1610,"cardLevel":11,"cardBody":"戈","cardMeaning":["Drunkard"],"meaningMnemonic":"This is a ceremony radical with a slide radical. Why would someone be sliding on the floor at a ceremony? If they're adrunkard, that's why! People love to drink at ceremonies. And there's always at least one drunkard who takes it too far and slides across the floor doing the worm."},{"type":"radical","cardNo":1611,"cardLevel":11,"cardBody":"及","cardMeaning":["Escalator"],"meaningMnemonic":"Do you remember stairs (乃)? This radical is a lot like that, but it has extra bits and pieces. It's still stairs... but it's more complicated. And faster! That's why it's anescalatorinstead!"},{"type":"radical","cardNo":1612,"cardLevel":11,"cardBody":"少","cardMeaning":["Few"],"meaningMnemonic":"This radical is the same as the kanji. It meansfew."},{"type":"radical","cardNo":1613,"cardLevel":11,"cardBody":"申","cardMeaning":["Humble"],"meaningMnemonic":"This radical is the same as the kanji you learned earlier, but the meaning is a little different. It's not just for saying things humbly, it's for beinghumblein general. When you see this radical, think about being humble."},{"type":"radical","cardNo":1614,"cardLevel":11,"cardBody":"兄","cardMeaning":["Older Brother"],"meaningMnemonic":"This radical is the same as the kanji. It meansolder brother."},{"type":"radical","cardNo":1615,"cardLevel":11,"cardBody":"令","cardMeaning":["Orders"],"meaningMnemonic":"The \"Hat-Ground\" stamp is on this envelope. That can only mean one thing:Ordersfrom HQ. Imagine this stamp on some orders for you—read the orders out loud to help yourself remember that this hat-ground stamp means \"orders\" and nothing else."},{"type":"radical","cardNo":1616,"cardLevel":11,"cardBody":"艮","cardMeaning":["Root"],"meaningMnemonic":"If the sun is out and you kick the ground, you'll hit aroot. Roots try to come up when the sun is bright. But if you kick too hard, the root will trip you, so watch out!"},{"type":"radical","cardNo":1617,"cardLevel":11,"cardBody":"単","cardMeaning":["Simple"],"meaningMnemonic":"There's some stuff growing out of this rice paddy and there is a cross guarding over it. This rice paddy is owned by asimplefamily that lives the simple life. They grow their rice, pray to their god, and everything is nice and simple. Ahh, I'm jealous."},{"type":"radical","cardNo":1618,"cardLevel":11,"cardBody":"皮","cardMeaning":["Skin"],"meaningMnemonic":"This radical is the same as the kanji. It meansskin."},{"type":"radical","cardNo":1619,"cardLevel":11,"cardBody":"音","cardMeaning":["Sound"],"meaningMnemonic":"This radical is the same as the kanji. It meanssound."},{"type":"radical","cardNo":1620,"cardLevel":11,"cardMeaning":["Trash"],"meaningMnemonic":"There's a lid on top of something you're trying to keep private. It's yourtrash. You wouldn't want people going through your private trash, which is why we put lids on our trash cans. It's also illegal to look through someone's trash, so make sure you never do that.","cardImg":"trash.png"},{"type":"radical","cardNo":1793,"cardLevel":12,"cardBody":"亜","cardMeaning":["Asia"],"meaningMnemonic":"This radical looks like a helicopter on the ground. Or a TIE fighter from above (going to the side). Either way, it's okay because you know where both helicopters and TIE fighters are made:Asia! Most aircraft are made in Asia these days, ya know?"},{"type":"radical","cardNo":1794,"cardLevel":12,"cardBody":"予","cardMeaning":["Beforehand"],"meaningMnemonic":"This radical is the same as the kanji. It meansbeforehand."},{"type":"radical","cardNo":1795,"cardLevel":12,"cardBody":"業","cardMeaning":["Business"],"meaningMnemonic":"This radical is the same as the kanji. It meansbusiness."},{"type":"radical","cardNo":1796,"cardLevel":12,"cardBody":"其","cardMeaning":["Crab"],"meaningMnemonic":"This looks like the shellfish radical but it's spikier and crazier. Which shelled creature has spikes and pincers? The mightycrab!"},{"type":"radical","cardNo":1797,"cardLevel":12,"cardBody":"早","cardMeaning":["Early"],"meaningMnemonic":"This radical is the same as the kanji. It meansearly."},{"type":"radical","cardNo":1798,"cardLevel":12,"cardBody":"免","cardMeaning":["Excuse"],"meaningMnemonic":"This radical consists of some legs carrying the sun out of prison. Those legs are yours. When the police stop you, though, what's yourexcuse? Come up with one and say it out loud, starting with, \"My excuse is...\""},{"type":"radical","cardNo":1799,"cardLevel":12,"cardBody":"直","cardMeaning":["Fix"],"meaningMnemonic":"This radical is the same as the kanji. It meansfix."},{"type":"radical","cardNo":1800,"cardLevel":12,"cardBody":"示","cardMeaning":["Jackhammer"],"meaningMnemonic":"Do you see the handles on the top and the barb on the bottom? It's ajackhammer. How can you tell? The two diagonal lines on the side show the motion of the jackhammer going up and down really fast, doing what jackhammers do. BBBHHRZHHHHRHHRZHZHHZH JUJUJUJUJU."},{"type":"radical","cardNo":1801,"cardLevel":12,"cardBody":"求","cardMeaning":["Request"],"meaningMnemonic":"This radical is the same as the kanji. It meansrequest."},{"type":"radical","cardNo":1802,"cardLevel":12,"cardBody":"者","cardMeaning":["Someone"],"meaningMnemonic":"This radical is the same as the kanji. It meanssomeone."},{"type":"radical","cardNo":1803,"cardLevel":12,"cardMeaning":["Tofu"],"meaningMnemonic":"See the T and F that make up this radical? Those letters stand fortofu, our favorite bean curd blocks.","cardImg":"tofu.png"},{"type":"radical","cardNo":1804,"cardLevel":12,"cardBody":"共","cardMeaning":["Together"],"meaningMnemonic":"This radical is the same as the kanji. It meanstogether."},{"type":"radical","cardNo":1805,"cardLevel":12,"cardBody":"廴","cardMeaning":["Yoga"],"meaningMnemonic":"This looks like someone taking really huge steps and stretching themselves out. Does that sound like anything you know? It should, because it's what you do inyoga. Stretch out your legs and arms until you look like this radical. Great! You're doing yoga now!"},{"type":"radical","cardNo":1806,"cardLevel":12,"cardBody":"弟","cardMeaning":["Younger Brother"],"meaningMnemonic":"This radical is the same as the kanji. It meansyounger brother."},{"type":"radical","cardNo":1980,"cardLevel":13,"cardBody":"身","cardMeaning":["Body"],"meaningMnemonic":"This radical is almost the same as the kanji, but it drops the \"some\" from somebody, making this just abody. Like the physical body you're trapped in right now."},{"type":"radical","cardNo":1981,"cardLevel":13,"cardBody":"冊","cardMeaning":["Bookshelf"],"meaningMnemonic":"This looks like a bunch of books on a shelf. It's abookshelf!"},{"type":"radical","cardNo":1982,"cardLevel":13,"cardBody":"央","cardMeaning":["Center"],"meaningMnemonic":"This radical is the same as the kanji. It meanscenter."},{"type":"radical","cardNo":1983,"cardLevel":13,"cardBody":"丸","cardMeaning":["Circle"],"meaningMnemonic":"This radical is the same as the kanji. It meanscircle."},{"type":"radical","cardNo":1984,"cardLevel":13,"cardMeaning":["Creeper"],"meaningMnemonic":"Do you see the little mustache on top of the mouth? It's one of those creepy mustaches... a John Waters sort of deal. That's why this radical is calledcreeper. (It also bears some resemblance to a certain hissing green thing's head but... well, you remember it how you want.)","cardImg":"creeper.png"},{"type":"radical","cardNo":1985,"cardLevel":13,"cardBody":"東","cardMeaning":["East"],"meaningMnemonic":"This radical is the same as the kanji. It meanseast."},{"type":"radical","cardNo":1986,"cardLevel":13,"cardBody":"象","cardMeaning":["Elephant"],"meaningMnemonic":"What animal is a sad excuse for a pig? Anelephant. Imagine an elephant trying to pretend to be a pig. They're gray, not pink. And they have really long trunks, not little pig sniffers. And they're way, way bigger. Silly elephant."},{"type":"radical","cardNo":1987,"cardLevel":13,"cardBody":"果","cardMeaning":["Fruit"],"meaningMnemonic":"Everything's about rice in ancient Japan and China. So the rice paddy that is on the tree isn't rice, of course, it's another kind of food. It'sfruit!"},{"type":"radical","cardNo":1988,"cardLevel":13,"cardBody":"良","cardMeaning":["Good"],"meaningMnemonic":"This radical is the same as the kanji. It meansgood."},{"type":"radical","cardNo":1989,"cardLevel":13,"cardBody":"百","cardMeaning":["Hundred"],"meaningMnemonic":"This radical is the same as the kanji. It meanshundred."},{"type":"radical","cardNo":1990,"cardLevel":13,"cardBody":"意","cardMeaning":["Idea"],"meaningMnemonic":"This radical is the same as the kanji. It meansidea."},{"type":"radical","cardNo":1991,"cardLevel":13,"cardBody":"原","cardMeaning":["Original"],"meaningMnemonic":"There is something white and small stuck in this cliff. It's... it's... sooriginal, you can't name it. You've never seen anything like it. It's the one and only thing of its type. You decide to just name it \"original\" because you aren't a very original person..."},{"type":"radical","cardNo":1992,"cardLevel":13,"cardBody":"品","cardMeaning":["Products"],"meaningMnemonic":"Three boxes are stacked up on top of each other. These areproductswaiting to be shipped out."},{"type":"radical","cardNo":1993,"cardLevel":13,"cardBody":"畐","cardMeaning":["Scarecrow"],"meaningMnemonic":"A creeper in a rice paddy? That's just ascarecrow!"},{"type":"radical","cardNo":1994,"cardLevel":13,"cardBody":"尺","cardMeaning":["Shrimp"],"meaningMnemonic":"This radical has a little head and some shrimpy legs sticking out of it. That's because it's ashrimp!"},{"type":"radical","cardNo":1995,"cardLevel":13,"cardBody":"忄","cardMeaning":["Soul"],"meaningMnemonic":"There are fins floating off of what's left of a fish. This is the fish'ssoul, left over after you ate its body. Make sure you wave goodbye to the souls of the fish you eat. It's respectful."},{"type":"radical","cardNo":1996,"cardLevel":13,"cardBody":"坴","cardMeaning":["Womb"],"meaningMnemonic":"Legs appear between two lumps of dirt. This is the earth's version of awomb. Imagine a tiny baby growing under the ground and then sprouting out, legs first, into the world. Imagine being inside this dirt womb. It's warm and damp. You feel safe."},{"type":"radical","cardNo":2154,"cardLevel":14,"cardMeaning":["Bar"],"meaningMnemonic":"There are two drunkards here. That makes this radical abar. Where else are you gonna drink?","cardImg":"bar.png"},{"type":"radical","cardNo":2155,"cardLevel":14,"cardBody":"才","cardMeaning":["Genius"],"meaningMnemonic":"This radical is the same as the kanji. It meansgenius."},{"type":"radical","cardNo":2156,"cardLevel":14,"cardBody":"分","cardMeaning":["Part"],"meaningMnemonic":"This radical is the same as the kanji. It meanspart."},{"type":"radical","cardNo":2157,"cardLevel":14,"cardBody":"勺","cardMeaning":["Pool"],"meaningMnemonic":"There's a drop of water trapped in a prison. A prison for us to play in! It's apool! The water may not like being in there, but all of us hot people sure do."},{"type":"radical","cardNo":2158,"cardLevel":14,"cardBody":"公","cardMeaning":["Public"],"meaningMnemonic":"This radical is the same as the kanji. It meanspublic."},{"type":"radical","cardNo":2159,"cardLevel":14,"cardBody":"井","cardMeaning":["Well"],"meaningMnemonic":"Think of this radical like a map you're looking down on. There are four streets going through this small town. Right in the middle is the most important thing—thewell. Everyone goes through the four streets to get to the well and get the water they crave."},{"type":"radical","cardNo":2309,"cardLevel":15,"cardMeaning":["Grass"],"meaningMnemonic":"Don't confuse this with triceratops.Grassis closer together, and a little bushier, like this. It's also more random and squished down in parts. If you see a bush of lines like this, it's probably going to be grass.","cardImg":"grass.png"},{"type":"radical","cardNo":2310,"cardLevel":15,"cardBody":"丈","cardMeaning":["Height"],"meaningMnemonic":"There is a narwhal at the top of this slide. What's it doing? The narwhal is trying to increase itsheight. Picture a narwhal propping itself up on a slide. It's self-conscious of its height. It's trying to prove to all the other narwhals that it should be allowed to play in their narwhal games, even though it's not the same height as them."},{"type":"radical","cardNo":2311,"cardLevel":15,"cardBody":"男","cardMeaning":["Man"],"meaningMnemonic":"This radical is the same as the kanji. It meansman."},{"type":"radical","cardNo":2312,"cardLevel":15,"cardBody":"句","cardMeaning":["Paragraph"],"meaningMnemonic":"You're locking the things that come out of your mouth in prison. The prison of paper and rules, that is. These words turn into well-formedparagraphs."},{"type":"radical","cardNo":2313,"cardLevel":15,"cardBody":"去","cardMeaning":["Past"],"meaningMnemonic":"This radical is the same as the kanji. It meanspast."},{"type":"radical","cardNo":2314,"cardLevel":15,"cardMeaning":["Saw"],"meaningMnemonic":"You're constructing a table. On the table is a drop of blood, which is your blood. This is from cutting yourself on thesawthat you're using to make the table. Imagine yourself cutting yourself with the saw by accident. Ouch!","cardImg":"saw.png"},{"type":"radical","cardNo":2315,"cardLevel":15,"cardBody":"歩","cardMeaning":["Walk"],"meaningMnemonic":"This radical is the same as the kanji. It meanswalk."},{"type":"radical","cardNo":2449,"cardLevel":16,"cardBody":"付","cardMeaning":["Attach"],"meaningMnemonic":"This radical is the same as the kanji. It meansattach."},{"type":"radical","cardNo":2450,"cardLevel":16,"cardBody":"壴","cardMeaning":["Drum"],"meaningMnemonic":"This radical is made up of samurai and beans. Samurai used to put beans indrums so they could tap and shake them to make noise. Can you imagine shaking and tapping this drum radical?"},{"type":"radical","cardNo":2451,"cardLevel":16,"cardBody":"面","cardMeaning":["Face"],"meaningMnemonic":"You have a leaf, a mouth, and an eye. Those are all things you'll find on aface! Wait, you don't have a leaf growing out of your face? Huh... well just imagine you have a normal human face with a leaf on there somewhere, ya weirdo."},{"type":"radical","cardNo":2452,"cardLevel":16,"cardBody":"谷","cardMeaning":["Valley"],"meaningMnemonic":"This radical is the same as the kanji. It meansvalley."},{"type":"radical","cardNo":2453,"cardLevel":16,"cardMeaning":["Zombie"],"meaningMnemonic":"This radical has a figure reaching out both hands at you with some dirt on his head. This is azombie, and he must have just recently dug himself out of the grave by the looks of it.","cardImg":"zombie.png"},{"type":"radical","cardNo":2602,"cardLevel":17,"cardBody":"楽","cardMeaning":["Comfort"],"meaningMnemonic":"This radical is the same as the kanji. It meanscomfort."},{"type":"radical","cardNo":2603,"cardLevel":17,"cardBody":"非","cardMeaning":["Criminal"],"meaningMnemonic":"You think you see some legs behind those bars. Who gets put behind bars? Onlycriminals. This criminal is pretty tall, since you only see his legs behind there."},{"type":"radical","cardNo":2604,"cardLevel":17,"cardBody":"祭","cardMeaning":["Festival"],"meaningMnemonic":"This radical is the same as the kanji. It meansfestival."},{"type":"radical","cardNo":2605,"cardLevel":17,"cardBody":"吉","cardMeaning":["Good Luck"],"meaningMnemonic":"This is the samurai radical on top of the mouth radical. If you get to hear what a samurai says, you'll have reallygood luck. Samurai are pretty hard to find nowadays, which is probably why my luck has been so bad..."},{"type":"radical","cardNo":2606,"cardLevel":17,"cardBody":"兑","cardMeaning":["Guard"],"meaningMnemonic":"This radical is made up of horns and older brother. But those aren't really horns, they're a part of your older brother's newguarduniform. He's a guard now, of a bank or a museum. You don't know which, but you know he stands around a lot in his uniform now."},{"type":"radical","cardNo":2607,"cardLevel":17,"cardBody":"無","cardMeaning":["Nothing"],"meaningMnemonic":"There are a bunch of cages boiling. But you look inside the cages and there... there'snothing. You boiled whatever was in there down to nothing!"},{"type":"radical","cardNo":2608,"cardLevel":17,"cardBody":"苟","cardMeaning":["Poem"],"meaningMnemonic":"The flowery paragraph isn't just regular writing. It's flowery, which makes it apoem."},{"type":"radical","cardNo":2609,"cardLevel":17,"cardBody":"虍","cardMeaning":["Tiger"],"meaningMnemonic":"You lost seven toes on a cliff, but you consider yourself lucky considering you got them taken off by the clifftigerthat lives in the area. Imagine a tiger taking your seven toes as you hang off the edge of a cliff if it helps. Exciting! (And also painful!)"},{"type":"radical","cardNo":2781,"cardLevel":18,"cardBody":"争","cardMeaning":["Conflict"],"meaningMnemonic":"This radical is the same as the kanji. It meansconflict."},{"type":"radical","cardNo":2782,"cardLevel":18,"cardBody":"尭","cardMeaning":["Gambler"],"meaningMnemonic":"Thegamblerholds a cross as he plays blackjack. He stands on his two legs expectantly, hoping he hits the big one. He just put all his money down. If he doesn't win this one the gambler loses everything, including the two legs he's standing on."},{"type":"radical","cardNo":2783,"cardLevel":18,"cardBody":"幸","cardMeaning":["Happiness"],"meaningMnemonic":"This radical is the same as the kanji. It meanshappiness. Don't get it confused with the spicy radical辛, they're very similar!"},{"type":"radical","cardNo":2784,"cardLevel":18,"cardBody":"昔","cardMeaning":["Long Ago"],"meaningMnemonic":"This radical is the same as the kanji. It meanslong ago."},{"type":"radical","cardNo":2785,"cardLevel":18,"cardBody":"曽","cardMeaning":["Mask"],"meaningMnemonic":"This looks kind of like amask, right? It has horns, it has crazy eyes, and it has a big mouth. Nobody would actually look like this, which is why this is just a mask."},{"type":"radical","cardNo":2786,"cardLevel":18,"cardBody":"午","cardMeaning":["Noon"],"meaningMnemonic":"This radical is the same as the kanji. It meansnoon."},{"type":"radical","cardNo":2787,"cardLevel":18,"cardBody":"先","cardMeaning":["Previous"],"meaningMnemonic":"This radical is the same as the kanji. It meansprevious."},{"type":"radical","cardNo":2788,"cardLevel":18,"cardBody":"凶","cardMeaning":["Treasure Chest"],"meaningMnemonic":"There's a treasure radical inside this box. What holds treasures? Atreasure chest."},{"type":"radical","cardNo":2949,"cardLevel":19,"cardBody":"成","cardMeaning":["Become"],"meaningMnemonic":"This radical is the same as the kanji. It meansbecome."},{"type":"radical","cardNo":2950,"cardLevel":19,"cardBody":"复","cardMeaning":["Black Hole"],"meaningMnemonic":"When you shoot your gun at the sun, it becomes winter. The shot you fired sent the sun into a crazy chain reaction, making it implode in on itself and become ablack hole. Imagine this happening and imagine the shock you'd feel. You shot the sun. You caused this infinite winter (and soon black hole death)."},{"type":"radical","cardNo":2951,"cardLevel":19,"cardBody":"司","cardMeaning":["Director"],"meaningMnemonic":"This radical is the same as the kanji. It meansdirector."},{"type":"radical","cardNo":2952,"cardLevel":19,"cardBody":"我","cardMeaning":["Ego"],"meaningMnemonic":"There's a drunkard holding out his fingers. He's staring at them. Realizing who he is. He's becoming aware of hisego. Now that he's aware of himself, he's probably going to get an inflated ego too. Yuck."},{"type":"radical","cardNo":2953,"cardLevel":19,"cardBody":"感","cardMeaning":["Feeling"],"meaningMnemonic":"This radical is the same as the kanji. It meansfeeling."},{"type":"radical","cardNo":2954,"cardLevel":19,"cardBody":"由","cardMeaning":["Reason"],"meaningMnemonic":"This radical is the same as the kanji. It meansreason."},{"type":"radical","cardNo":2955,"cardLevel":19,"cardBody":"右","cardMeaning":["Right"],"meaningMnemonic":"This radical is the same as the kanji. It meansright."},{"type":"radical","cardNo":3097,"cardLevel":20,"cardMeaning":["Explosion"],"meaningMnemonic":"See the energy bursting outward? That's anexplosion. Boom!","cardImg":"explosion.png"},{"type":"radical","cardNo":3098,"cardLevel":20,"cardBody":"巛","cardMeaning":["Flood"],"meaningMnemonic":"The three lines that make up the river radical are being pulled to one direction. It's a giant force of water going to the left. It's aflood! RUN!"},{"type":"radical","cardNo":3099,"cardLevel":20,"cardBody":"飛","cardMeaning":["Fly"],"meaningMnemonic":"This radical is pretty complicated, but not much looks like this radical, so you're in luck. This looks like a giant flying fortress of some kind. See the propellers on the back as it moves to the left? Just imagine something like this flying through the air. That's why this radical isfly, because it is flying."},{"type":"radical","cardNo":3100,"cardLevel":20,"cardBody":"至","cardMeaning":["Mole"],"meaningMnemonic":"There's trash on some dirt that seems to be... moving? If you lift up that trash you'll find amolein the dirt! Moles like to dig around underground and look for stuff to grab (like trash). They're the raccoons of the ground."},{"type":"radical","cardNo":3101,"cardLevel":20,"cardBody":"兼","cardMeaning":["Mona Lisa"],"meaningMnemonic":"This radical looks like a combination of the brush radical and the beauty kanji (美). So what's something beautiful you can paint with a brush? The most famous is probably theMona Lisa."},{"type":"radical","cardNo":3102,"cardLevel":20,"cardBody":"義","cardMeaning":["Righteousness"],"meaningMnemonic":"The horns of the king. They are so large and they cause the king to have an ego. This ego gives the king a sense ofrighteousnessthat he shouldn't have. Well, I suppose that's what kings do, but those horns are ridiculous."},{"type":"radical","cardNo":3250,"cardLevel":21,"cardBody":"角","cardMeaning":["Angle"],"meaningMnemonic":"This radical is the same as the kanji. It meansangle."},{"type":"radical","cardNo":3251,"cardLevel":21,"cardBody":"刃","cardMeaning":["Blade"],"meaningMnemonic":"You have a sword that has a drop of something on it. That drop is a drop of blood. Sure, a sword will cut someone to spill some blood, but all you really need is any kind ofbladeto cut someone. Sword, knife, whatever, as long as it's a blade."},{"type":"radical","cardNo":3252,"cardLevel":21,"cardBody":"半","cardMeaning":["Half"],"meaningMnemonic":"This radical is the same as the kanji. It meanshalf."},{"type":"radical","cardNo":3253,"cardLevel":21,"cardBody":"啇","cardMeaning":["Mohawk"],"meaningMnemonic":"You have something old on your head that's standing up. What is this thing? An awesomemohawk. You've had it so long it's looking pretty old... but still awesome."},{"type":"radical","cardNo":3254,"cardLevel":21,"cardBody":"次","cardMeaning":["Next"],"meaningMnemonic":"This radical is the same as the kanji. It meansnext."},{"type":"radical","cardNo":3255,"cardLevel":21,"cardBody":"番","cardMeaning":["Number"],"meaningMnemonic":"This radical is the same as the kanji, but \"number in a series\" is too long. Let's shorten it tonumber."},{"type":"radical","cardNo":3256,"cardLevel":21,"cardBody":"平","cardMeaning":["Peace"],"meaningMnemonic":"This radical is the same as the kanji. It meanspeace."},{"type":"radical","cardNo":3257,"cardLevel":21,"cardBody":"斉","cardMeaning":["Simultaneous"],"meaningMnemonic":"If you're writing while looking at the moon, you can bet someone else is doing it too. People have a habit of looking at the moonsimultaneously."},{"type":"radical","cardNo":3398,"cardLevel":22,"cardBody":"能","cardMeaning":["Ability"],"meaningMnemonic":"This radical is the same as the kanji. It meansability."},{"type":"radical","cardNo":3399,"cardLevel":22,"cardBody":"充","cardMeaning":["Allocate"],"meaningMnemonic":"You have some legs and you need to put them in the trash. But you'll get caught if you put them in one trash can. Quick, cut them up andallocatethem to different trash cans around the city. Then you'll never get caught."},{"type":"radical","cardNo":3400,"cardLevel":22,"cardBody":"呂","cardMeaning":["Bathtub"],"meaningMnemonic":"See the dude sitting inside the box? His head is sticking out the top. That's abathtubhe's sitting in."},{"type":"radical","cardNo":3401,"cardLevel":22,"cardBody":"安","cardMeaning":["Cheap"],"meaningMnemonic":"This radical is the same as the kanji. It meanscheap."},{"type":"radical","cardNo":3402,"cardLevel":22,"cardBody":"弗","cardMeaning":["Dollar"],"meaningMnemonic":"This is a squiggle with two lines through it. Hmmm doesn't that seem familiar? It should, because it's thedollarsymbol: $. Well, close enough. Just look at this and think, ah yes, a totally normal American dollar."},{"type":"radical","cardNo":3403,"cardLevel":22,"cardBody":"爰","cardMeaning":["Football"],"meaningMnemonic":"Your friend is on the ground and you step on him with your cleat. There is no friendship here. This is a true sport you're playing. This isfootball."},{"type":"radical","cardNo":3404,"cardLevel":22,"cardBody":"丬","cardMeaning":["Icicle"],"meaningMnemonic":"This ice is in the shape of a stick. It's anicicle!"},{"type":"radical","cardNo":3556,"cardLevel":23,"cardBody":"衣","cardMeaning":["Clothes"],"meaningMnemonic":"You kick a lid off a box. Inside the box is a bunch ofclothes. This radical will be the same as the kanji you'll learn later on, so it's helpful to learn it as clothes even though it doesn't quite look like clothes."},{"type":"radical","cardNo":3557,"cardLevel":23,"cardBody":"鬼","cardMeaning":["Demon"],"meaningMnemonic":"This is ademon. Can you see him? He has a crazy face and some tentacles holding something demonic. Try to figure out how to see a demon. But don't see him too good, cause then he'll come out of your computer and eat you."},{"type":"radical","cardNo":3558,"cardLevel":23,"cardBody":"革","cardMeaning":["Leather"],"meaningMnemonic":"When I look at this radical, I see the body and (mainly) head of a bull. What are bulls made of? They're made ofleather."},{"type":"radical","cardNo":3559,"cardLevel":23,"cardMeaning":["Morning"],"meaningMnemonic":"This is the left side of the kanji朝, so we'll call itmorningtoo.","cardImg":"morning.png"},{"type":"radical","cardNo":3560,"cardLevel":23,"cardBody":"亭","cardMeaning":["Restaurant"],"meaningMnemonic":"You see a lid on the street with a drawing of a forehead and a mouth on it. Hmm strange. You pick the lid up and reveal... a secret, undergroundrestaurant! The mouth + forehead combo was secret street restaurant code for, \"There's good eats down in this here restaurant hole!\""},{"type":"radical","cardNo":3561,"cardLevel":23,"cardBody":"道","cardMeaning":["Road"],"meaningMnemonic":"This radical is the same as the kanji. It meansroad."},{"type":"radical","cardNo":3562,"cardLevel":23,"cardBody":"丩","cardMeaning":["Vines"],"meaningMnemonic":"This radical is made up of twovineshanging down and a branch linking them together. Imagine swinging on these Tarzan style. AaaaAA aAA AAAaaaa!"},{"type":"radical","cardNo":3696,"cardLevel":24,"cardBody":"受","cardMeaning":["Accept"],"meaningMnemonic":"This radical is the same as the kanji. It meansaccept."},{"type":"radical","cardNo":3697,"cardLevel":24,"cardBody":"制","cardMeaning":["Control"],"meaningMnemonic":"This radical is the same as the kanji. It meanscontrol."},{"type":"radical","cardNo":3698,"cardLevel":24,"cardBody":"旦","cardMeaning":["Dawn"],"meaningMnemonic":"The sun is coming up out of the ground, making this radicaldawn. Of course, don't confuse this with dusk! You can do that by thinking that the sun is an optimistic and bright thing, so it tends to come up, not go down. (Also, Japan is the Land of the Rising Sun. I mean come on!)"},{"type":"radical","cardNo":3699,"cardLevel":24,"cardMeaning":["Death Star"],"meaningMnemonic":"There is a hat covering the moon and it's holding a knife. Wait, that's no moon. It's a space station! It's theDeath Star! It's pretending to be a moon under that hat. And it's armed! Don't let the Death Star stab your planet to death.","cardImg":"death star.png"},{"type":"radical","cardNo":3700,"cardLevel":24,"cardBody":"客","cardMeaning":["Guest"],"meaningMnemonic":"This radical is the same as the kanji. It meansguest."},{"type":"radical","cardNo":3701,"cardLevel":24,"cardBody":"韋","cardMeaning":["Korea"],"meaningMnemonic":"There are five mouths eating cow atKorean BBQ. Korea is famous for their delicious BBQ, and you need a lot of people to eat all that beef. At least five people. (Get it? Five people!) That's why this radical is Korea."},{"type":"radical","cardNo":3702,"cardLevel":24,"cardBody":"然","cardMeaning":["Nature"],"meaningMnemonic":"This radical is the same as the kanji. It meansnature."},{"type":"radical","cardNo":3860,"cardLevel":25,"cardBody":"両","cardMeaning":["Both"],"meaningMnemonic":"This radical is the same as the kanji. It meansboth."},{"type":"radical","cardNo":3861,"cardLevel":25,"cardBody":"京","cardMeaning":["Capital"],"meaningMnemonic":"This radical is the same as the kanji. It meanscapital."},{"type":"radical","cardNo":3862,"cardLevel":25,"cardBody":"友","cardMeaning":["Friend"],"meaningMnemonic":"This radical is the same as the kanji. It meansfriend."},{"type":"radical","cardNo":3863,"cardLevel":25,"cardBody":"莫","cardMeaning":["Greenhouse"],"meaningMnemonic":"Flowers grow big from the sun. In order to let them grow as big as possible, we put them in thegreenhouse."},{"type":"radical","cardNo":3864,"cardLevel":25,"cardBody":"冓","cardMeaning":["Lifeguard"],"meaningMnemonic":"You have a task to save two kinds of lives. Who saves two kinds of lives? Alifeguard. They save the lives of people drowning, and then the lives of the people who go to try to help them. Picture a lifeguard saving the lives of two people at once. What a hero!"},{"type":"radical","cardNo":3865,"cardLevel":25,"cardBody":"禹","cardMeaning":["Mantis"],"meaningMnemonic":"This radical has slide, head, and insect in it. Which insect will slide your head off in a matter of seconds and then eat it? The fearsome prayingmantis."},{"type":"radical","cardNo":3866,"cardLevel":25,"cardBody":"交","cardMeaning":["Mix"],"meaningMnemonic":"This radical is the same as the kanji. It meansmix."},{"type":"radical","cardNo":3867,"cardLevel":25,"cardBody":"甫","cardMeaning":["Wedding"],"meaningMnemonic":"This radical looks like someone wearing a giant dress who has a tear in their eye. This is a person at theirwedding. That explains the big dress and the tear (of happiness!) in their eye."},{"type":"radical","cardNo":4006,"cardLevel":26,"cardBody":"告","cardMeaning":["Announce"],"meaningMnemonic":"This radical is the same as the kanji. It meansannounce."},{"type":"radical","cardNo":4007,"cardLevel":26,"cardBody":"章","cardMeaning":["Chapter"],"meaningMnemonic":"This radical is the same as the kanji. It meanschapter."},{"type":"radical","cardNo":4008,"cardLevel":26,"cardMeaning":["Comb"],"meaningMnemonic":"Look at all those little things sticking out. You could easily use it tocombyour hair.","cardImg":"comb.png"},{"type":"radical","cardNo":4009,"cardLevel":26,"cardBody":"万","cardMeaning":["Ten Thousand"],"meaningMnemonic":"This radical is the same as the kanji. It meansten thousand."},{"type":"radical","cardNo":4010,"cardLevel":26,"cardBody":"倉","cardMeaning":["Warehouse"],"meaningMnemonic":"You put your hat on the ground and a flag in your mouth. You're letting the world know that they can use your mouth as awarehouse. Your gullet is open for storage business. Need to store some ice cream? Please use my mouth warehouse. ;D ;D ;D"},{"type":"radical","cardNo":4168,"cardLevel":27,"cardBody":"召","cardMeaning":["Call"],"meaningMnemonic":"If someone has a sword to your mouth you need tocallout for help! Call out as loud as you can to anyone nearby who might help you get this guy to take the sword out of your mouth."},{"type":"radical","cardNo":4169,"cardLevel":27,"cardBody":"化","cardMeaning":["Change"],"meaningMnemonic":"This radical is the same as the kanji. It meanschange."},{"type":"radical","cardNo":4170,"cardLevel":27,"cardBody":"出","cardMeaning":["Exit"],"meaningMnemonic":"This radical is the same as the kanji. It meansexit."},{"type":"radical","cardNo":4171,"cardLevel":27,"cardBody":"農","cardMeaning":["Farming"],"meaningMnemonic":"This radical is the same as the kanji. It meansfarming."},{"type":"radical","cardNo":4172,"cardLevel":27,"cardBody":"民","cardMeaning":["Peoples"],"meaningMnemonic":"This radical is the same as the kanji. It meanspeoples."},{"type":"radical","cardNo":4173,"cardLevel":27,"cardBody":"而","cardMeaning":["Rake"],"meaningMnemonic":"If you look at it, you can see it's a weird lookingrake."},{"type":"radical","cardNo":4174,"cardLevel":27,"cardBody":"代","cardMeaning":["Substitute"],"meaningMnemonic":"This radical is the same as the kanji. It meanssubstitute."},{"type":"radical","cardNo":4175,"cardLevel":27,"cardBody":"余","cardMeaning":["Surplus"],"meaningMnemonic":"This radical is the same as the kanji. It meanssurplus."},{"type":"radical","cardNo":4315,"cardLevel":28,"cardBody":"屯","cardMeaning":["Barracks"],"meaningMnemonic":"You stick an umbrella with a big slide on it into the mountainside to make yourbarracks. You're going to use these barracks to teach soldiers how to slide slides and hide from bad weather. It's ingenious!"},{"type":"radical","cardNo":4316,"cardLevel":28,"cardBody":"巨","cardMeaning":["Giant"],"meaningMnemonic":"If you were to look at agiantfrom above, this is what you would see. Do you see the head and two arms? The giant is facing towards the right."},{"type":"radical","cardNo":4317,"cardLevel":28,"cardBody":"麗","cardMeaning":["Lovely"],"meaningMnemonic":"I don't know what this thing is, but it'slovely. It has two eyes, a funny mouth, and a scraggly beard. It's lovely, and nothing else, okay? So remember it that way."},{"type":"radical","cardNo":4318,"cardLevel":28,"cardBody":"奇","cardMeaning":["Odd"],"meaningMnemonic":"A big lip ring is a prettyoddthing to have. If it's big, it'll stretch your lip out, which is odd too."},{"type":"radical","cardNo":4319,"cardLevel":28,"cardBody":"専","cardMeaning":["Specialty"],"meaningMnemonic":"This radical is the same as the kanji. It meansspecialty."},{"type":"radical","cardNo":4471,"cardLevel":29,"cardBody":"上","cardMeaning":["Above"],"meaningMnemonic":"This radical is the same as the kanji. It meansabove."},{"type":"radical","cardNo":4472,"cardLevel":29,"cardBody":"責","cardMeaning":["Blame"],"meaningMnemonic":"This radical is the same as the kanji. It meansblame."},{"type":"radical","cardNo":4473,"cardLevel":29,"cardBody":"尞","cardMeaning":["Charcoal"],"meaningMnemonic":"When the sun gets small, you need to heat up by throwing some big horns in the fire. This turns into charcoal. Nice, toastycharcoalthat keeps you warm when the sun gets small."},{"type":"radical","cardNo":4474,"cardLevel":29,"cardBody":"区","cardMeaning":["District"],"meaningMnemonic":"This radical is the same as the kanji. It meansdistrict."},{"type":"radical","cardNo":4475,"cardLevel":29,"cardMeaning":["Hills"],"meaningMnemonic":"See the rollinghillswith the road going off into the background to another hill? That's why this is the hills radical.","cardImg":"hills.png"},{"type":"radical","cardNo":4476,"cardLevel":29,"cardBody":"乙","cardMeaning":["Nose"],"meaningMnemonic":"If you look at this radical right, you'll see aNOSE(with a squinty eye on the left)."},{"type":"radical","cardNo":4477,"cardLevel":29,"cardBody":"臣","cardMeaning":["Servant"],"meaningMnemonic":"Hey, it's that giant you learned before. But... but its arms are chained. They're chained because you caught the giant and now it's yourservant!"},{"type":"radical","cardNo":4621,"cardLevel":30,"cardBody":"系","cardMeaning":["Lineage"],"meaningMnemonic":"A thread goes through the ground. It traces yourlineage. You follow the thread all the way back through many generations, to find out your lineage involves Genghis Khan. Feel the thread and the dirt in your hand and actually trace the lineage."},{"type":"radical","cardNo":4622,"cardLevel":30,"cardBody":"北","cardMeaning":["North"],"meaningMnemonic":"This radical is the same as the kanji. It meansnorth."},{"type":"radical","cardNo":4623,"cardLevel":30,"cardBody":"片","cardMeaning":["One Sided"],"meaningMnemonic":"This looks a bit like a waiter walking toward you with a platter in their hands... but wait. It's only half of a waiter. It's aone sidedwaiter!"},{"type":"radical","cardNo":4624,"cardLevel":30,"cardBody":"監","cardMeaning":["Oversee"],"meaningMnemonic":"This radical is the same as the kanji. It meansoversee."},{"type":"radical","cardNo":4625,"cardLevel":30,"cardBody":"冘","cardMeaning":["Pirate"],"meaningMnemonic":"This kind of looks like big (大), which I think you'll remember you learned by pretending this was a big guy. This big guy, however, has a funny leg... a peg leg. That makes him apirate. Also, his arms are in the \"YARRRR\" position."},{"type":"radical","cardNo":4626,"cardLevel":30,"cardBody":"甲","cardMeaning":["Turtle Shell"],"meaningMnemonic":"Poor turtles. We don't like them here. This is aturtle shell. See the shell with just a tail remaining? It's the only thing we didn't remove off the turtle. It's just a shell with a tail, so basically it's just a turtle shell."},{"type":"radical","cardNo":4760,"cardLevel":31,"cardBody":"鬲","cardMeaning":["Bully"],"meaningMnemonic":"He's a creeper and he's Four-T (forty). If someone like this creeps on you, they're just abully. When you get to forty you aren't supposed to creep on people anymore. You bully. You jerk."},{"type":"radical","cardNo":4761,"cardLevel":31,"cardBody":"牙","cardMeaning":["Fang"],"meaningMnemonic":"Imagine this in your mouth. It's one tooth that sticks out more than any other. It's yourfang. Can you see this sticking out of a wolf mouth instead? Try that if you can't picture yourself with a fang this cool."},{"type":"radical","cardNo":4762,"cardLevel":31,"cardBody":"郎","cardMeaning":["Guy"],"meaningMnemonic":"This radical is the same as the kanji. It meansguy."},{"type":"radical","cardNo":4763,"cardLevel":31,"cardBody":"扁","cardMeaning":["Library"],"meaningMnemonic":"There's a door over the bookcase. That makes this alibrary!"},{"type":"radical","cardNo":4764,"cardLevel":31,"cardBody":"並","cardMeaning":["Line Up"],"meaningMnemonic":"This radical is the same as the kanji. It meansline up."},{"type":"radical","cardNo":4765,"cardLevel":31,"cardBody":"离","cardMeaning":["Rocket"],"meaningMnemonic":"This is a very complicated and tall radical. It has a lid on top to keep the explosiveness in. It also contains a treasure, at least for the people who will receive what's inside. Also, it has a cow, which will be used for milk on Mars. This is arocketfilled with goodies for space people."},{"type":"radical","cardNo":4912,"cardLevel":32,"cardBody":"卬","cardMeaning":["Cat Pirate"],"meaningMnemonic":"See the CP in this radical? It stands forCat Pirate. Meoaarrrr."},{"type":"radical","cardNo":4913,"cardLevel":32,"cardBody":"必","cardMeaning":["Certain"],"meaningMnemonic":"This radical is the same as the kanji. It meanscertain."},{"type":"radical","cardNo":4914,"cardLevel":32,"cardBody":"舎","cardMeaning":["Cottage"],"meaningMnemonic":"This radical looks like a little house, one that would be perfect in the middle of nowhere, surrounded by bamboo and a little mountain stream. See the roof and the open door? That's why this is thecottageradical."},{"type":"radical","cardNo":4915,"cardLevel":32,"cardMeaning":["Elf"],"meaningMnemonic":"You see a leaf ear, better known as anelf! Elves are just humans who have ears that are pointy like leaves.","cardImg":"elf.png"},{"type":"radical","cardNo":4916,"cardLevel":32,"cardBody":"夜","cardMeaning":["Night"],"meaningMnemonic":"This radical is the same as the kanji. It meansnight."},{"type":"radical","cardNo":4917,"cardLevel":32,"cardBody":"同","cardMeaning":["Same"],"meaningMnemonic":"This radical is the same as the kanji. It meanssame."},{"type":"radical","cardNo":4918,"cardLevel":32,"cardBody":"夋","cardMeaning":["Spider"],"meaningMnemonic":"If you look closely and carefully, sometimes you can see some private legs in winter. Whose legs?Spiderlegs! It's too cold for them in winter, so they hide in cracks and crevices, but sometimes you can see their little leggies sticking out anyway."},{"type":"radical","cardNo":5071,"cardLevel":33,"cardMeaning":["Coral"],"meaningMnemonic":"In the water is a barb on the ground. It'scoral. Coral may look pretty, but if you slip in the water and step on it, you're gonna get scratched up. That stuff is roooough.","cardImg":"coral.png"},{"type":"radical","cardNo":5072,"cardLevel":33,"cardBody":"内","cardMeaning":["Inside"],"meaningMnemonic":"This radical is the same as the kanji. It meansinside."},{"type":"radical","cardNo":5073,"cardLevel":33,"cardBody":"間","cardMeaning":["Interval"],"meaningMnemonic":"This radical is the same as the kanji. It meansinterval."},{"type":"radical","cardNo":5074,"cardLevel":33,"cardBody":"享","cardMeaning":["Sock"],"meaningMnemonic":"Best way to put a lid on the mouth of a child is to put asockin that child's mouth. Shuts them up good, it does. Add a nice fat sock and they can't talk anymore, essentially putting a lid on their mouth."},{"type":"radical","cardNo":5075,"cardLevel":33,"cardBody":"蔵","cardMeaning":["Storehouse"],"meaningMnemonic":"Your flowers become your servants. You plant them, you water them, you bring them up, then you cut them down and put them in yourstorehouse. They do what you want because they become YOUR servants, not the other way around. That's why you can tell them to sit in the storehouse where they wait until you come to eat them."},{"type":"radical","cardNo":5076,"cardLevel":33,"cardBody":"喿","cardMeaning":["Syrup"],"meaningMnemonic":"The products trees make? That'ssyrup. Delicious maple syrup, for example. Mmmm!"},{"type":"radical","cardNo":5077,"cardLevel":33,"cardBody":"広","cardMeaning":["Wide"],"meaningMnemonic":"This radical is the same as the kanji. It meanswide."},{"type":"radical","cardNo":5211,"cardLevel":34,"cardBody":"堇","cardMeaning":["Boot"],"meaningMnemonic":"There's something made of leather with some dirt on the bottom of it. It's aboot!"},{"type":"radical","cardNo":5212,"cardLevel":34,"cardBody":"呉","cardMeaning":["Catapult"],"meaningMnemonic":"See the rock in thecatapult? It even has little legs to hold it steady so it can catapult better."},{"type":"radical","cardNo":5213,"cardLevel":34,"cardBody":"爪","cardMeaning":["Claw"],"meaningMnemonic":"This looks like aclawof some kind already, making it quite easy!"},{"type":"radical","cardNo":5214,"cardLevel":34,"cardBody":"員","cardMeaning":["Member"],"meaningMnemonic":"This radical is the same as the kanji. It meansmember."},{"type":"radical","cardNo":5215,"cardLevel":34,"cardBody":"亥","cardMeaning":["Slice"],"meaningMnemonic":"See the guy? See how he was CUT IN HALF??? That must have been one heckuvasliceto do that to a person."},{"type":"radical","cardNo":5371,"cardLevel":35,"cardBody":"帯","cardMeaning":["Belt"],"meaningMnemonic":"This radical is the same as the kanji. It meansbelt."},{"type":"radical","cardNo":5372,"cardLevel":35,"cardBody":"将","cardMeaning":["Commander"],"meaningMnemonic":"Who wears cleats and takes your measurements for so long that icicles start forming on your body? Yourcommander. The commander is very, very particular. And everyone knows the commander has to get everything exactly right. So taking your measurements takes SO long that icicles grow out of your nose. But that's okay. You have to impress your new commander, darn it!"},{"type":"radical","cardNo":5373,"cardLevel":35,"cardBody":"為","cardMeaning":["Sake"],"meaningMnemonic":"This radical looks like a big, weird caterpillar bug thing. But, for the sake of everyone's sanity, we'll just call itsake, okay? Keep in mind, we mean sake as in \"for the sake of X,\" not as in the alcoholic beverage!"},{"type":"radical","cardNo":5374,"cardLevel":35,"cardBody":"彑","cardMeaning":["Shuriken"],"meaningMnemonic":"See theshurikenstuck into the ground? In case you don't know, a shuriken is just a throwing star. Awesome ninjas use them. That's what's in this radical."},{"type":"radical","cardNo":5375,"cardLevel":35,"cardBody":"亀","cardMeaning":["Turtle"],"meaningMnemonic":"There's a turtle shell inside thisturtleradical. You can tell because there's a whole head and tail on this thing, making it a real turtle, not just a turtle shell."},{"type":"radical","cardNo":5510,"cardLevel":36,"cardBody":"明","cardMeaning":["Bright"],"meaningMnemonic":"This radical is the same as the kanji. It meansbright."},{"type":"radical","cardNo":5511,"cardLevel":36,"cardBody":"舛","cardMeaning":["Dance"],"meaningMnemonic":"You see a cow in the evening. You get closer and realize it's doing adance. All cows dance in the evening. Can you picture it? The cow is dancing, so majestic, in the setting sunlight."},{"type":"radical","cardNo":5512,"cardLevel":36,"cardBody":"発","cardMeaning":["Departure"],"meaningMnemonic":"This radical is the same as the kanji. It meansdeparture."},{"type":"radical","cardNo":5513,"cardLevel":36,"cardBody":"南","cardMeaning":["South"],"meaningMnemonic":"This radical is the same as the kanji. It meanssouth."},{"type":"radical","cardNo":5514,"cardLevel":36,"cardBody":"甘","cardMeaning":["Sweet"],"meaningMnemonic":"This radical is the sun with its hair sticking out. Why is the sun's hair sticking out like this? It ate wayyy too manysweetthings causing it to have too much energy, making its hair stand on end. It also kind of looks like a sweet, sweet candy with the wrapper sticking out. Remember it how you'd like."},{"type":"radical","cardNo":5515,"cardLevel":36,"cardBody":"貴","cardMeaning":["Valuable"],"meaningMnemonic":"This radical is the same as the kanji. It meansvaluable."},{"type":"radical","cardNo":5650,"cardLevel":37,"cardBody":"兆","cardMeaning":["Omen"],"meaningMnemonic":"There's an explosion around your legs. It was just as the fortune teller warned. This is theomenshe was talking about. Think about what happens after the omen hits. What horrible fortune teller magic will happen???"},{"type":"radical","cardNo":5651,"cardLevel":37,"cardBody":"賞","cardMeaning":["Prize"],"meaningMnemonic":"This radical is the same as the kanji. It meansprize."},{"type":"radical","cardNo":5652,"cardLevel":37,"cardBody":"串","cardMeaning":["Skewer"],"meaningMnemonic":"There's a stick going through some juicy meat. This is askewer."},{"type":"radical","cardNo":5653,"cardLevel":37,"cardBody":"暴","cardMeaning":["Violence"],"meaningMnemonic":"This radical is the same as the kanji. It meansviolence."},{"type":"radical","cardNo":5654,"cardLevel":37,"cardBody":"包","cardMeaning":["Wrap"],"meaningMnemonic":"Yourself (oneself) is in prison. Look at the prison as it wraps around you. It wraps you up and holds you tight. That's why this is thewrapradical!"},{"type":"radical","cardNo":5806,"cardLevel":38,"cardBody":"有","cardMeaning":["Have"],"meaningMnemonic":"This radical is the same as the kanji. It meanshave."},{"type":"radical","cardNo":5807,"cardLevel":38,"cardBody":"辟","cardMeaning":["Hot Pepper"],"meaningMnemonic":"You see something with a flag on it and put it in your mouth. It was spicy! You look at the little flag and it says...hot pepper."},{"type":"radical","cardNo":5808,"cardLevel":38,"cardBody":"県","cardMeaning":["Prefecture"],"meaningMnemonic":"This radical is the same as the kanji. It meansprefecture."},{"type":"radical","cardNo":5809,"cardLevel":38,"cardBody":"空","cardMeaning":["Sky"],"meaningMnemonic":"This radical is the same as the kanji. It meanssky."},{"type":"radical","cardNo":5810,"cardLevel":38,"cardBody":"思","cardMeaning":["Think"],"meaningMnemonic":"This radical is the same as the kanji. It meansthink."},{"type":"radical","cardNo":5811,"cardLevel":38,"cardBody":"歯","cardMeaning":["Tooth"],"meaningMnemonic":"This radical is the same as the kanji. It meanstooth."},{"type":"radical","cardNo":5948,"cardLevel":39,"cardBody":"君","cardMeaning":["Buddy"],"meaningMnemonic":"This radical is the same as the kanji. It meansbuddy."},{"type":"radical","cardNo":5949,"cardLevel":39,"cardBody":"旧","cardMeaning":["Former"],"meaningMnemonic":"This radical is the same as the kanji. It meansformer."},{"type":"radical","cardNo":5950,"cardLevel":39,"cardBody":"岡","cardMeaning":["Hill"],"meaningMnemonic":"This radical is the same as the kanji. It meanshill."},{"type":"radical","cardNo":5951,"cardLevel":39,"cardBody":"㐮","cardMeaning":["Nurse"],"meaningMnemonic":"This radical is made up of blackjack and clothes with the six kanji on top. If you see six people playing blackjack and wearing the same clothes you should know that they're allnurses. Nurses play blackjack together to cool down between shifts and they usually don't have time to change out of their uniforms. That's why this radical is nurse."},{"type":"radical","cardNo":5952,"cardLevel":39,"cardBody":"真","cardMeaning":["Reality"],"meaningMnemonic":"This radical is the same as the kanji. It meansreality."},{"type":"radical","cardNo":5953,"cardLevel":39,"cardBody":"巻","cardMeaning":["Scroll"],"meaningMnemonic":"This radical is the same as the kanji. It meansscroll."},{"type":"radical","cardNo":5954,"cardLevel":39,"cardBody":"三","cardMeaning":["Three"],"meaningMnemonic":"This radical is the same as the kanji. It meansthree."},{"type":"radical","cardNo":6093,"cardLevel":40,"cardBody":"雇","cardMeaning":["Employ"],"meaningMnemonic":"This radical is the same as the kanji. It meansemploy."},{"type":"radical","cardNo":6094,"cardLevel":40,"cardBody":"毎","cardMeaning":["Every"],"meaningMnemonic":"This radical is the same as the kanji. It meansevery."},{"type":"radical","cardNo":6095,"cardLevel":40,"cardBody":"保","cardMeaning":["Preserve"],"meaningMnemonic":"This radical is the same as the kanji. It meanspreserve."},{"type":"radical","cardNo":6096,"cardLevel":40,"cardBody":"喜","cardMeaning":["Rejoice"],"meaningMnemonic":"This radical is the same as the kanji. It meansrejoice."},{"type":"radical","cardNo":6252,"cardLevel":41,"cardMeaning":["Cactus"],"meaningMnemonic":"See thecactuscoming out of the ground? It's happy to see you!","cardImg":"cactus.png"},{"type":"radical","cardNo":6253,"cardLevel":41,"cardBody":"宣","cardMeaning":["Proclaim"],"meaningMnemonic":"This radical is the same as the kanji. It meansproclaim."},{"type":"radical","cardNo":6254,"cardLevel":41,"cardBody":"華","cardMeaning":["Showy"],"meaningMnemonic":"This radical is the same as the kanji. It meansshowy."},{"type":"radical","cardNo":6255,"cardLevel":41,"cardBody":"夆","cardMeaning":["Signpost"],"meaningMnemonic":"This is a post with signs on it. And on top is a winter marker, showing that if you go north it's winter up there. The signs say things like \"Narnia ↑\" and \"Meridell ←\" and \"Bananaland →\" so you know it's asignpost."},{"type":"radical","cardNo":6256,"cardLevel":41,"cardBody":"妻","cardMeaning":["Wife"],"meaningMnemonic":"This radical is the same as the kanji. It meanswife."},{"type":"radical","cardNo":6406,"cardLevel":42,"cardBody":"骨","cardMeaning":["Bone"],"meaningMnemonic":"This radical is the same as the kanji. It meansbone."},{"type":"radical","cardNo":6407,"cardLevel":42,"cardBody":"瓜","cardMeaning":["Melon"],"meaningMnemonic":"This is amelon. Imagine a melon cut in half, and you're looking at its insides from the side. See those precious private melon parts? You're gonna keep those for yourself, because melons are delicious and not for sharing."},{"type":"radical","cardNo":6408,"cardLevel":42,"cardMeaning":["Satellite"],"meaningMnemonic":"Look at this radical. Can you see it floating in space? Can you see the antennae and reflectors? That's because it's asatellite.","cardImg":"satellite.png"},{"type":"radical","cardNo":6409,"cardLevel":42,"cardBody":"屋","cardMeaning":["Shop"],"meaningMnemonic":"We already have a roof radical, so we're going to use the secondary kanji meaning for this radical. It'sshop, remember?"},{"type":"radical","cardNo":6541,"cardLevel":43,"cardBody":"豸","cardMeaning":["Badger"],"meaningMnemonic":"You know the animal radical. This is just like that with a little extra. It's an animal already... which means all you have to do is remember what kind of animal. In this case, it's abadger."},{"type":"radical","cardNo":6542,"cardLevel":43,"cardBody":"龍","cardMeaning":["Imperial"],"meaningMnemonic":"Stand up on the moon so you can look down on your countries. The thing with all the lines and borders are the borders of all the countries you rule, for you are animperial."},{"type":"radical","cardNo":6543,"cardLevel":43,"cardBody":"耒","cardMeaning":["Plow"],"meaningMnemonic":"You're sliding some dirt around with a tree you cut down. This contraption you've made is called aplow. Use it to push dirt around!"},{"type":"radical","cardNo":6692,"cardLevel":44,"cardBody":"缶","cardMeaning":["Can"],"meaningMnemonic":"It's kind of hard to see, but if you look at this the right way it looks like a tincan. The lines in the middle show the circumference, and the lines on the tops and sides show the outline of the can."},{"type":"radical","cardNo":6693,"cardLevel":44,"cardBody":"竜","cardMeaning":["Dragon"],"meaningMnemonic":"A turtle that stands up isn't a turtle anymore. It's evolved into a monster. What kind of monster? Adragon! Rawwwr."},{"type":"radical","cardNo":6694,"cardLevel":44,"cardBody":"風","cardMeaning":["Wind"],"meaningMnemonic":"This radical is the same as the kanji. It meanswind."},{"type":"radical","cardNo":6835,"cardLevel":45,"cardBody":"更","cardMeaning":["Again"],"meaningMnemonic":"This radical is the same as the kanji. It meansagain."},{"type":"radical","cardNo":6836,"cardLevel":45,"cardBody":"家","cardMeaning":["House"],"meaningMnemonic":"This radical is the same as the kanji. It meanshouse."},{"type":"radical","cardNo":6837,"cardLevel":45,"cardBody":"守","cardMeaning":["Protect"],"meaningMnemonic":"This radical is the same as the kanji. It meansprotect."},{"type":"radical","cardNo":6971,"cardLevel":46,"cardBody":"太","cardMeaning":["Fat"],"meaningMnemonic":"This radical is the same as the kanji. It meansfat."},{"type":"radical","cardNo":6972,"cardLevel":46,"cardBody":"恵","cardMeaning":["Favor"],"meaningMnemonic":"This radical is the same as the kanji. It meansfavor."},{"type":"radical","cardNo":7116,"cardLevel":47,"cardBody":"敝","cardMeaning":["Penguin"],"meaningMnemonic":"There are fins wrapped in a towel in winter. Who is drying these fish fins to eat them? Apenguin."},{"type":"radical","cardNo":7117,"cardLevel":47,"cardBody":"波","cardMeaning":["Wave"],"meaningMnemonic":"This radical is the same as the kanji. It meanswave."},{"type":"radical","cardNo":7248,"cardLevel":48,"cardBody":"容","cardMeaning":["Form"],"meaningMnemonic":"This radical is the same as the kanji. It meansform."},{"type":"radical","cardNo":7249,"cardLevel":48,"cardBody":"玄","cardMeaning":["Mysterious"],"meaningMnemonic":"What's under this lid that smells like poop? I don't know! Howmysterious."},{"type":"radical","cardNo":7250,"cardLevel":48,"cardBody":"光","cardMeaning":["Sunlight"],"meaningMnemonic":"This radical is the same as the kanji. It meanssunlight."},{"type":"radical","cardNo":7393,"cardLevel":49,"cardBody":"甚","cardMeaning":["Crab Trap"],"meaningMnemonic":"This radical looks like a small animal (匹) has a crab (其) sticking out of it. Often when a crab is eating a small animal, that small animal was put inside a crab trap to catch the crab, luring it in with the small animal. That's why this radical iscrab trap."},{"type":"radical","cardNo":7394,"cardLevel":49,"cardBody":"回","cardMeaning":["Times"],"meaningMnemonic":"This radical is the same as the kanji. It meanstimes."},{"type":"radical","cardNo":7395,"cardLevel":49,"cardBody":"荒","cardMeaning":["Wild"],"meaningMnemonic":"This radical is the same as the kanji. It meanswild."},{"type":"radical","cardNo":7539,"cardLevel":50,"cardBody":"名","cardMeaning":["Name"],"meaningMnemonic":"This radical is the same as the kanji. It meansname."},{"type":"radical","cardNo":7540,"cardLevel":50,"cardMeaning":["Psychopath"],"meaningMnemonic":"Inside this guy's forehead you have a spoon and a bunch of hair, not to mention whatever that is in the top left. That's the mind of apsychopathright there.","cardImg":"psychopath.png"},{"type":"radical","cardNo":7541,"cardLevel":50,"cardBody":"禺","cardMeaning":["Splinter"],"meaningMnemonic":"Although a little bit modified, there is a turtle shell that's on a mustache with this radical. The only thing with a mustache that hangs around turtles is Splinter, the giant rat from Teenage Mutant Ninja Turtles. So this radical isSplinter(the giant rat)."},{"type":"radical","cardNo":7665,"cardLevel":51,"cardBody":"胃","cardMeaning":["Stomach"],"meaningMnemonic":"This radical is the same as the kanji. It meansstomach."},{"type":"radical","cardNo":7781,"cardLevel":52,"cardBody":"夌","cardMeaning":["Frostbite"],"meaningMnemonic":"This radical is made of dirt, legs, and winter. If you have to bury your legs in the dirt in winter, it's probably because you gotfrostbite. You had to leave your dead legs behind. :("},{"type":"radical","cardNo":7915,"cardLevel":53,"cardBody":"高","cardMeaning":["Tall"],"meaningMnemonic":"This radical is the same as the kanji. It meanstall."},{"type":"radical","cardNo":8205,"cardLevel":55,"cardBody":"疑","cardMeaning":["Doubt"],"meaningMnemonic":"This radical is the same as the kanji. It meansdoubt."},{"type":"radical","cardNo":8440,"cardLevel":57,"cardBody":"凹","cardMeaning":["Concave"],"meaningMnemonic":"It looks like there is a dent in this box. When there is a hole or a dent in something it's calledconcave."},{"type":"radical","cardNo":8441,"cardLevel":57,"cardBody":"凸","cardMeaning":["Convex"],"meaningMnemonic":"This looks like a box with something sticking out of it. When something is sticking out of something else it'sconvex."},{"type":"radical","cardNo":8680,"cardLevel":59,"cardBody":"下","cardMeaning":["Below"],"meaningMnemonic":"This radical is the same as the kanji. It meansbelow."},{"type":"radical","cardNo":8801,"cardLevel":60,"cardBody":"勇","cardMeaning":["Courage"],"meaningMnemonic":"This radical is the same as the kanji. It meanscourage."}]